'******** 2ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½Îºï¿½ ï¿½Ê±ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½Î±×·ï¿½ ********

'-*- coding: utf-8 -*-'

DIM I AS BYTE
DIM J AS BYTE
DIM MODE AS BYTE
DIM A AS BYTE
DIM A_old AS BYTE
DIM B AS BYTE
DIM C AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½Óµï¿½ AS BYTE
DIM ï¿½Â¿ï¿½Óµï¿½ AS BYTE
DIM ï¿½Â¿ï¿½Óµï¿½2 AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½Ã¼Å© AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½ONOFF AS BYTE
DIM ï¿½ï¿½ï¿½Ì·ï¿½ONOFF AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½Õµï¿½ AS INTEGER
DIM ï¿½ï¿½ï¿½ï¿½ï¿½Â¿ï¿½ AS INTEGER

DIM ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ AS BYTE

DIM ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½È®ï¿½ï¿½È½ï¿½ï¿½ AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ AS BYTE
DIM ï¿½ï¿½ï¿½ï¿½COUNT AS BYTE

DIM ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½  AS BYTE

DIM S11  AS BYTE
DIM S16  AS BYTE
'**************************************
DIM NO_0 AS BYTE
DIM NO_1 AS BYTE
DIM NO_2 AS BYTE
DIM NO_3 AS BYTE
DIM NO_4 AS BYTE

DIM NUM AS BYTE

DIM BUTTON_NO AS INTEGER
DIM SOUND_BUSY AS BYTE
DIM TEMP_INTEGER AS INTEGER

'**** ï¿½ï¿½ï¿½â¼¾ï¿½ï¿½ï¿½ï¿½Æ® ï¿½ï¿½ï¿½ï¿½ ****
CONST ï¿½ÕµÚ±ï¿½ï¿½ï¿½ADï¿½ï¿½Æ® = 0
CONST ï¿½Â¿ï¿½ï¿½ï¿½ï¿½ADï¿½ï¿½Æ® = 1
CONST ï¿½ï¿½ï¿½ï¿½È®ï¿½Î½Ã°ï¿½ = 20  'ms

CONST ï¿½ï¿½ï¿½Ü¼ï¿½ADï¿½ï¿½Æ®  = 4


CONST min = 61	'ï¿½Ú·Î³Ñ¾ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
CONST max = 107	'ï¿½ï¿½ï¿½ï¿½ï¿½Î³Ñ¾ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
CONST COUNT_MAX = 3


CONST ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½ = 10
'************************************************



PTP SETON 				'ï¿½ï¿½ï¿½ï¿½ï¿½×·ìº° ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½
PTP ALLON				'ï¿½ï¿½Ã¼ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½

DIR G6A,1,0,0,1,0,0		'ï¿½ï¿½ï¿½ï¿½0~5ï¿½ï¿½
DIR G6D,0,1,1,0,1,1		'ï¿½ï¿½ï¿½ï¿½18~23ï¿½ï¿½
DIR G6B,1,1,1,1,1,1		'ï¿½ï¿½ï¿½ï¿½6~11ï¿½ï¿½
DIR G6C,0,0,0,0,1,0		'ï¿½ï¿½ï¿½ï¿½12~17ï¿½ï¿½

'************************************************

OUT 52,0	'ï¿½Ó¸ï¿½ LED ï¿½Ñ±ï¿½
'***** ï¿½Ê±â¼±ï¿½ï¿½ '************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
ï¿½ï¿½ï¿½ï¿½Ã¼Å© = 0
ï¿½ï¿½ï¿½ï¿½È®ï¿½ï¿½È½ï¿½ï¿½ = 0
ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ = 1
ï¿½ï¿½ï¿½ï¿½ONOFF = 0

'****ï¿½Ê±ï¿½ï¿½ï¿½Ä¡ ï¿½Çµï¿½ï¿½*****************************


TEMPO 230
'MUSIC "cdefg"



SPEED 5
GOSUB MOTOR_ON

S11 = MOTORIN(11)
S16 = MOTORIN(16)

SERVO 11, 100
SERVO 16, S16

SERVO 16, 100


GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½Ê±ï¿½ï¿½Ú¼ï¿½
GOSUB ï¿½âº»ï¿½Ú¼ï¿½


GOSUB ï¿½ï¿½ï¿½Ì·ï¿½INIT
GOSUB ï¿½ï¿½ï¿½Ì·ï¿½MID
GOSUB ï¿½ï¿½ï¿½Ì·ï¿½ON



PRINT "VOLUME 200 !"
'PRINT "SOUND 12 !" 'ï¿½È³ï¿½ï¿½Ï¼ï¿½ï¿½ï¿½

GOSUB All_motor_mode3





GOTO MAIN	'ï¿½Ã¸ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½Æ¾ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½

'************************************************

'*********************************************
' Infrared_Distance = 60 ' About 20cm
' Infrared_Distance = 50 ' About 25cm
' Infrared_Distance = 30 ' About 45cm
' Infrared_Distance = 20 ' About 65cm
' Infrared_Distance = 10 ' About 95cm
'*********************************************
'************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    TEMPO 220
    'MUSIC "O23EAB7EA>3#C"
    RETURN
    '************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    TEMPO 220
    'MUSIC "O38GD<BGD<BG"
    RETURN
    '************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    TEMPO 250
    MUSIC "FFF"
    RETURN
    '************************************************
    '************************************************
MOTOR_ON: 'ï¿½ï¿½ï¿½ï¿½Æ®ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Í»ï¿½ë¼³ï¿½ï¿½

    GOSUB MOTOR_GET

    MOTOR G6B
    DELAY 50
    MOTOR G6C
    DELAY 50
    MOTOR G6A
    DELAY 50
    MOTOR G6D

    ï¿½ï¿½ï¿½ï¿½ONOFF = 0
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½			
    RETURN

    '************************************************
    'ï¿½ï¿½ï¿½ï¿½Æ®ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Í»ï¿½ë¼³ï¿½ï¿½
MOTOR_OFF:

    MOTOROFF G6B
    MOTOROFF G6C
    MOTOROFF G6A
    MOTOROFF G6D
    ï¿½ï¿½ï¿½ï¿½ONOFF = 1	
    GOSUB MOTOR_GET	
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½	
    RETURN
    '************************************************
    'ï¿½ï¿½Ä¡ï¿½ï¿½ï¿½Çµï¿½ï¿½
MOTOR_GET:
    GETMOTORSET G6A,1,1,1,1,1,0
    GETMOTORSET G6B,1,1,1,0,0,1
    GETMOTORSET G6C,1,1,1,0,1,0
    GETMOTORSET G6D,1,1,1,1,1,0
    RETURN

    '************************************************
    'ï¿½ï¿½Ä¡ï¿½ï¿½ï¿½Çµï¿½ï¿½
MOTOR_SET:
    GETMOTORSET G6A,1,1,1,1,1,0
    GETMOTORSET G6B,1,1,1,0,0,1
    GETMOTORSET G6C,1,1,1,0,1,0
    GETMOTORSET G6D,1,1,1,1,1,0
    RETURN

    '************************************************
All_motor_Reset:

    MOTORMODE G6A,1,1,1,1,1,1
    MOTORMODE G6D,1,1,1,1,1,1
    MOTORMODE G6B,1,1,1,,,1
    MOTORMODE G6C,1,1,1,,1

    RETURN
    '************************************************
All_motor_mode2:

    MOTORMODE G6A,2,2,2,2,2
    MOTORMODE G6D,2,2,2,2,2
    MOTORMODE G6B,2,2,2,,,2
    MOTORMODE G6C,2,2,2,,2

    RETURN
    '************************************************
All_motor_mode3:

    MOTORMODE G6A,3,3,3,3,3
    MOTORMODE G6D,3,3,3,3,3
    MOTORMODE G6B,3,3,3,,,3
    MOTORMODE G6C,3,3,3,,3

    RETURN
    '************************************************
Leg_motor_mode1:
    MOTORMODE G6A,1,1,1,1,1
    MOTORMODE G6D,1,1,1,1,1
    RETURN
    '************************************************
Leg_motor_mode2:
    MOTORMODE G6A,2,2,2,2,2
    MOTORMODE G6D,2,2,2,2,2
    RETURN

    '************************************************
Leg_motor_mode3:
    MOTORMODE G6A,3,3,3,3,3
    MOTORMODE G6D,3,3,3,3,3
    RETURN
    '************************************************
Leg_motor_mode4:
    MOTORMODE G6A,3,2,2,1,3
    MOTORMODE G6D,3,2,2,1,3
    RETURN
    '************************************************
Leg_motor_mode5:
    MOTORMODE G6A,3,2,2,1,2
    MOTORMODE G6D,3,2,2,1,2
    RETURN
    '************************************************
Arm_motor_mode1:
    MOTORMODE G6B,1,1,1,,,1
    MOTORMODE G6C,1,1,1,,1
    RETURN
    '************************************************
Arm_motor_mode2:
    MOTORMODE G6B,2,2,2,,,2
    MOTORMODE G6C,2,2,2,,2
    RETURN

    '************************************************
Arm_motor_mode3:
    MOTORMODE G6B,3,3,3,,,3
    MOTORMODE G6C,3,3,3,,3
    RETURN
    '************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½Ê±ï¿½ï¿½Ú¼ï¿½:
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6B,100,  35,  90,
    MOVE G6C,100,  35,  90
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD

=======
    
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======

>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======
    
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    WAIT
    mode = 0
    RETURN
    '************************************************
ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½:
    MOVE G6A,98,  76, 145,  93, 101, 100
    MOVE G6D,98,  76, 145,  93, 101, 100
    MOVE G6B,100,  35,  90,
    MOVE G6C,100,  35,  90
    WAIT
    mode = 0

    RETURN
    '******************************************	


    '************************************************
<<<<<<< HEAD
<<<<<<< HEAD
±âº»ÀÚ¼¼:
<<<<<<< HEAD
<<<<<<< HEAD

=======
	
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======

>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======
ï¿½âº»ï¿½Ú¼ï¿½:
	
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
ï¿½âº»ï¿½Ú¼ï¿½:
	
=======
±âº»ÀÚ¼¼:

>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6B,100,  30,  80,
    MOVE G6C,100,  30,  80,
    WAIT
    mode = 0

    RETURN
    '******************************************	
ï¿½âº»ï¿½Ú¼ï¿½2:
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6B,100,  30,  80,
    MOVE G6C,100,  30,  80
    WAIT

    mode = 0
    RETURN
    '******************************************	
ï¿½ï¿½ï¿½ï¿½ï¿½Ú¼ï¿½:
    MOVE G6A,100, 56, 182, 76, 100, 100
    MOVE G6D,100, 56, 182, 76, 100, 100
    MOVE G6B,100,  30,  80,
    MOVE G6C,100,  30,  80
    WAIT
    mode = 2
    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½Ú¼ï¿½:
    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½OFF
    MOVE G6A,100, 145,  28, 145, 100, 100
    MOVE G6D,100, 145,  28, 145, 100, 100
    MOVE G6B,100,  30,  80,
    MOVE G6C,100,  30,  80
    WAIT
    mode = 1

    RETURN
    '******************************************
    '***********************************************
    '***********************************************
    '**** ï¿½ï¿½ï¿½Ì·Î°ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ****
ï¿½ï¿½ï¿½Ì·ï¿½INIT:

    GYRODIR G6A, 0, 0, 1, 0,0
    GYRODIR G6D, 1, 0, 1, 0,0

    GYROSENSE G6A,200,150,30,150,0
    GYROSENSE G6D,200,150,30,150,0

    RETURN
    '***********************************************
    '**** ï¿½ï¿½ï¿½Ì·Î°ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ****
ï¿½ï¿½ï¿½Ì·ï¿½MAX:

    GYROSENSE G6A,250,180,30,180,0
    GYROSENSE G6D,250,180,30,180,0

    RETURN
    '***********************************************
ï¿½ï¿½ï¿½Ì·ï¿½MID:

    GYROSENSE G6A,200,150,30,150,0
    GYROSENSE G6D,200,150,30,150,0

    RETURN
    '***********************************************
ï¿½ï¿½ï¿½Ì·ï¿½MIN:

    GYROSENSE G6A,200,100,30,100,0
    GYROSENSE G6D,200,100,30,100,0
    RETURN
    '******************ZERO G6A,100, 101, 102, 106, 100, 100
    ZERO G6B,102, 101, 100, 100, 100, 100
    ZERO G6C, 97, 100,  96, 100, 100, 100
    ZERO G6D,100, 103, 103, 104, 103, 100
    '*****************************
ï¿½ï¿½ï¿½Ì·ï¿½ON:

    GYROSET G6A, 4, 3, 3, 3, 0
    GYROSET G6D, 4, 3, 3, 3, 0

    ï¿½ï¿½ï¿½Ì·ï¿½ONOFF = 1

    RETURN
    '***********************************************
ï¿½ï¿½ï¿½Ì·ï¿½OFF:

    GYROSET G6A, 0, 0, 0, 0, 0
    GYROSET G6D, 0, 0, 0, 0, 0


    ï¿½ï¿½ï¿½Ì·ï¿½ONOFF = 0
    RETURN

    '************************************************

    '******************************************
    '**********************************************
    '**********************************************
RX_EXIT:

    ERX 4800, A, MAIN

    GOTO RX_EXIT
    '**********************************************
GOSUB_RX_EXIT:

    ERX 4800, A, GOSUB_RX_EXIT2

    GOTO GOSUB_RX_EXIT

GOSUB_RX_EXIT2:
    RETURN
    '**********************************************
    '**********************************************


ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    SPEED 7
    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1: 'ï¿½Þ¹ï¿½
    'HIGHSPEED SETON
    MOVE G6A,95,  90, 125, 100, 104
    MOVE G6D,106,  77, 147,  93,  102
    MOVE G6B, 85
    MOVE G6C,115
    WAIT


ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,103,   73, 140, 103,  100
    MOVE G6D, 95,  85, 147,  85, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ERX 4800,A, ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop:
        MOVE G6D,95,  90, 125, 95, 104
        MOVE G6A,104,  76, 145,  91,  102
        MOVE G6C, 100
        MOVE G6B,100
        WAIT

        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        'HIGHSPEED SETOFF
        GOTO RX_EXIT
    ENDIF

    '*********************************

ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4: 'ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    MOVE G6D,95,  95, 120, 100, 104
    MOVE G6A,102,  77, 147,  93,  102
    MOVE G6C, 85
    MOVE G6B,115
    WAIT


ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5:
    MOVE G6D,103,    73, 140, 103,  100
    MOVE G6A, 95,  85, 147,  85, 102
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ERX 4800,A, ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop:
        MOVE G6A,95,  90, 125, 95, 104
        MOVE G6D,104,  76, 145,  91,  102
        MOVE G6B, 100
        MOVE G6C,100
        WAIT

        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        'HIGHSPEED SETOFF
        GOTO RX_EXIT
    ENDIF
    '*************************************

    GOTO ï¿½ï¿½ï¿½Îµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1

    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50:
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    DELAY 50
    SPEED 6
    HIGHSPEED SETON



    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  77, 146,  93, 98
        WAIT

        MOVE G6A,95,  82, 120, 120, 104
        MOVE G6D,104,  79, 147,  91,  102
        MOVE G6B, 80
        MOVE G6C,120
        WAIT


        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 146,  93, 101
        MOVE G6A,101,  77, 145,  93, 98
        WAIT

        MOVE G6D,95,  82, 121, 120, 104
        MOVE G6A,104,  79, 146,  91,  102
        MOVE G6C, 80
        MOVE G6B,120
        WAIT


        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1:
    MOVE G6A,95,  97, 100, 120, 104
    MOVE G6D,104,  79, 148,  93,  102
    MOVE G6B, 80
    MOVE G6C,120
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2:
    MOVE G6A,95,  77, 122, 120, 104
    MOVE G6D,104,  80, 148,  90,  100
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3:
    MOVE G6A,103,  69, 145, 103,  100
    MOVE G6D, 95, 87, 161,  68, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop:

        MOVE G6D,90,  93, 116, 100, 104
        MOVE G6A,104,  74, 145,  91,  102
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        DELAY 150
        GOTO RX_EXIT
    ENDIF
    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4:
    MOVE G6D,95,  97, 101, 120, 104
    MOVE G6A,104,  79, 147,  93,  102
    MOVE G6C, 80
    MOVE G6B,120
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5:
    MOVE G6D,95,  77, 123, 120, 104
    MOVE G6A,104,  80, 147,  90,  100
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6:
    MOVE G6D,103,  71, 146, 103,  100
    MOVE G6A, 95, 89, 160,  68, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop
    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop:

        MOVE G6A,90,  93, 115, 100, 104
        MOVE G6D,104,  74, 146,  91,  102
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        DELAY 150
        GOTO RX_EXIT
    ENDIF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 13
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    GOSUB Leg_motor_mode3

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1

        SPEED 4

        MOVE G6A, 88,  74, 144,  95, 110
        MOVE G6D,108,  76, 148,  93,  96
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        SPEED 10'

        MOVE G6A, 90, 90, 120, 105, 110,100
        MOVE G6D,110,  76, 149,  93,  96,100
        MOVE G6B,90
        MOVE G6C,110
        WAIT


        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1	
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0

        SPEED 4

        MOVE G6D,  88,  74, 146,  95, 110
        MOVE G6A, 108,  76, 146,  93,  96
        MOVE G6C, 100
        MOVE G6B, 100
        WAIT

        SPEED 10

        MOVE G6D, 90, 90, 122, 105, 110,100
        MOVE G6A,110,  76, 147,  93,  96,100
        MOVE G6C,90
        MOVE G6B,110
        WAIT


        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2	

    ENDIF


    '*******************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
 
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)

=======
 
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======

>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:

    ETX 4800,11 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½
    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6A, 86,  56, 145, 115, 110
    MOVE G6D,108,  76, 149,  93,  96
    WAIT


    SPEED ï¿½Â¿ï¿½Óµï¿½
    GOSUB Leg_motor_mode3

    MOVE G6A,110,  76, 147, 93,  96
    MOVE G6D,86, 100, 147,  69, 110
    WAIT


    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2
    ELSE
        ' GOSUB Leg_motor_mode3

        MOVE G6A,112,  76, 146,  93, 96,100
        MOVE G6D,90, 100, 102, 115, 110,100
        MOVE G6B,110
        MOVE G6C,90
        WAIT
        HIGHSPEED SETOFF

        SPEED 8
        MOVE G6A, 106,  76, 146,  93,  96,100		
        MOVE G6D,  88,  71, 154,  91, 106,100
        MOVE G6B, 100
        MOVE G6C, 100
        WAIT	

        SPEED 2
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        GOTO RX_EXIT
    ENDIF
    '**********

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,110,  76, 147,  93, 96,100
    MOVE G6D,90, 90, 122, 105, 110,100
    MOVE G6B,110
    MOVE G6C,90
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    ETX 4800,11 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 86,  56, 147, 115, 110
    MOVE G6A,108,  76, 147,  93,  96
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,110,  76, 149, 93,  96
    MOVE G6A,86, 100, 145,  69, 110
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ELSE

        MOVE G6A, 90, 100, 100, 115, 110,100
        MOVE G6D,112,  76, 148,  93,  96,100
        MOVE G6B,90
        MOVE G6C,110
        WAIT
        HIGHSPEED SETOFF
        SPEED 8

        MOVE G6D, 106,  76, 148,  93,  96,100		
        MOVE G6A,  88,  71, 152,  91, 106,100
        MOVE G6C, 100
        MOVE G6B, 100
        WAIT	
        SPEED 2
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        GOTO RX_EXIT
    ENDIF

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    'ï¿½Þ¹ßµï¿½ï¿½10
    MOVE G6A,90, 90, 120, 105, 110,100
    MOVE G6D,110,  76, 148,  93,  96,100
    MOVE G6B, 90
    MOVE G6C,110
    WAIT

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    '*******************************
    '*******************************


    '************************************************
ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 12
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    MOVE G6A, 100,  76, 145,  93, 100, 100
    MOVE G6D, 100,  76, 145,  93, 100, 100
    MOVE G6B, 100,  30,  80, 100, 100, 102
    MOVE G6C, 100,  30,  80, 100,  89, 100
    WAIT


    GOSUB Leg_motor_mode3
    HIGHSPEED SETON
    SPEED 10
    MOVE G6D,  90,  74, 144,  95, 110
    MOVE G6A, 108,  76, 146,  93, 96
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

    SPEED 12
    MOVE G6D,90, 90, 120, 105, 110,100
    MOVE G6A,108,  76, 147,  93,  96,100
    MOVE G6C,90
    MOVE G6B,110
    WAIT

    HIGHSPEED SETOFF
    GOTO ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_2	

ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 102, 107,100
    MOVE G6B,110
    MOVE G6C,90
    WAIT

ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_3:
    ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 115, 112
    MOVE G6A,108,  76, 147,  93,  96
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 93,  98
    MOVE G6A,90, 100, 145,  69, 108
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_4
    IF A = 11 THEN
        GOTO ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½_4:
    SPEED 13
    MOVE G6A,95, 90, 120, 105, 111,100
    MOVE G6D,108,  76, 146,  93,  96,100
    MOVE G6B, 90
    MOVE G6C,110
    WAIT

    ' SPEED 10
    '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    ' GOTO ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½

    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN

    '*******************************************************************************************************************************
ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    MOVE G6D, 100,  76, 145,  93, 100, 100
    MOVE G6A, 100,  76, 145,  93, 100, 100
    MOVE G6B, 100,  30,  80, 100, 100, 102
    MOVE G6C, 100,  30,  80, 100,  89, 100
    WAIT


    GOSUB Leg_motor_mode3
    HIGHSPEED SETON
    SPEED 10
    MOVE G6A,  90,  74, 144,  95, 110
    MOVE G6D, 108,  76, 146,  93, 96
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

    SPEED 12
    MOVE G6A,90, 90, 120, 105, 110,100
    MOVE G6D,108,  76, 147,  93,  96,100
    MOVE G6C,90
    MOVE G6B,110
    WAIT

    HIGHSPEED SETOFF
    GOTO ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_2	

ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_2:
    MOVE G6D,110,  76, 147,  93, 100,100
    MOVE G6A,96, 90, 120, 102, 107,100
    MOVE G6B,110
    MOVE G6C,90
    WAIT

ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_3:
    ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6A, 90,  56, 145, 115, 112
    MOVE G6D,108,  76, 147,  93,  96
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6A,108,  76, 147, 93,  98
    MOVE G6D,90, 100, 145,  69, 108
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_4
    IF A = 11 THEN
        GOTO ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½Ñ°ï¿½ï¿½ï¿½ï¿½È±ï¿½2_4:
    SPEED 9
    MOVE G6D,95, 90, 120, 105, 111,100
    MOVE G6A,108,  76, 146,  93,  96,100
    MOVE G6B, 90
    MOVE G6C,110
    WAIT

    SPEED 6
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN
    '*******************************************************
ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    MOVE G6B,185,  10,  60
    MOVE G6C,185,  10,  60
    WAIT

    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 147,  93, 98
        MOVE G6D,101,  76, 146,  93, 95
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 146,  93, 98
        MOVE G6A,101,  76, 147,  93, 95
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6A,95,  90, 125, 100, 101
    MOVE G6D,104,  77, 146,  93,  99
    WAIT


ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,103,   73, 140, 103,  97
    MOVE G6D, 95,  85, 146,  85, 99
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop:
        MOVE G6D,95,  90, 124, 95, 101
        MOVE G6A,104,  76, 145,  91,  99
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        MOVE G6A,98,  76, 145,  93, 101, 97
        MOVE G6D,98,  76, 145,  93, 101, 97
        'GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '  SPEED 5
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6D,95,  95, 119, 100, 101
    MOVE G6A,104,  77, 147,  93,  99
    WAIT


ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5:
    MOVE G6D,103,    73, 139, 103,  97
    MOVE G6A, 95,  85, 147,  85, 99
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop:
        MOVE G6A,95,  90, 125, 95, 101
        MOVE G6D,104,  76, 144,  91,  99
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        MOVE G6A,98,  76, 145,  93, 101, 97
        MOVE G6D,98,  76, 145,  93, 101, 97
        ' GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        ' SPEED 5
        '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*************************************

    '*********************************

    GOTO ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1

    '-----------------------------------------------------------------

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 12
    ï¿½Â¿ï¿½Óµï¿½ = 4
    GOSUB Leg_motor_mode3



    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1

        SPEED 4
        MOVE G6A, 88,  71, 152,  91, 110
        MOVE G6D,108,  76, 145,  93,  96
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        SPEED 10
        MOVE G6A, 90, 100, 100, 115, 110
        MOVE G6D,110,  76, 145,  93,  96
        MOVE G6B,90
        MOVE G6C,110
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1	
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0

        SPEED 4
        MOVE G6D,  88,  71, 152,  91, 110
        MOVE G6A, 108,  76, 145,  93,  96
        MOVE G6C, 100
        MOVE G6B, 100
        WAIT

        SPEED 10
        MOVE G6D, 90, 100, 100, 115, 110
        MOVE G6A,110,  76, 145,  93,  96
        MOVE G6C,90
        MOVE G6B,110
        WAIT


        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2

    ENDIF


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    ETX 4800,12 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½
    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D,110,  76, 145, 93,  96
    MOVE G6A,90, 98, 145,  69, 110
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D, 90,  60, 137, 120, 110
    MOVE G6A,107,  85, 137,  93,  96
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    SPEED 11

    MOVE G6D,90, 90, 120, 105, 110
    MOVE G6A,112,  76, 146,  93, 96
    MOVE G6B,110
    MOVE G6C,90
    WAIT

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1_EXIT:
        HIGHSPEED SETOFF
        SPEED 5

        MOVE G6A, 106,  76, 145,  93,  96		
        MOVE G6D,  85,  72, 148,  91, 106
        MOVE G6B, 100
        MOVE G6C, 100
        WAIT	

        SPEED 3
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        GOTO RX_EXIT
    ENDIF
    '**********

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    ETX 4800,12 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½
    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½
    MOVE G6A,110,  76, 145, 93,  96
    MOVE G6D,90, 98, 145,  69, 110
    WAIT


    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6A, 90,  60, 137, 120, 110
    MOVE G6D,107  85, 137,  93,  96
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    SPEED 11
    MOVE G6A,90, 90, 120, 105, 110
    MOVE G6D,112,  76, 146,  93,  96
    MOVE G6B, 90
    MOVE G6C,110
    WAIT


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_EXIT:
        HIGHSPEED SETOFF
        SPEED 5

        MOVE G6D, 106,  76, 145,  93,  96		
        MOVE G6A,  85,  72, 148,  91, 106
        MOVE G6B, 100
        MOVE G6C, 100
        WAIT	

        SPEED 3
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        GOTO RX_EXIT
    ENDIF  	

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    '**********************************************

    '******************************************
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6A,95,  90, 125, 100, 104
    MOVE G6D,104,  77, 147,  93,  102
    MOVE G6B, 85
    MOVE G6C,115
    WAIT


È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,103,   73, 140, 103,  100
    MOVE G6D, 95,  85, 147,  85, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop

    ERX 4800,A, È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop:
        MOVE G6D,95,  90, 125, 95, 104
        MOVE G6A,104,  76, 145,  91,  102
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6D,95,  95, 120, 100, 104
    MOVE G6A,104,  77, 147,  93,  102
    MOVE G6C, 85
    MOVE G6B,115
    WAIT


È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5:
    MOVE G6D,103,    73, 140, 103,  100
    MOVE G6A, 95,  85, 147,  85, 102
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop

    ERX 4800,A, È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop:
        MOVE G6A,95,  90, 125, 95, 104
        MOVE G6D,104,  76, 145,  91,  102
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*************************************

    '*********************************

    GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1

    '******************************************

    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6A,95,  90, 125, 100, 104
    MOVE G6D,104,  77, 147,  93,  102
    MOVE G6B, 85
    MOVE G6C,115
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,103,   73, 140, 103,  100
    MOVE G6D, 95,  85, 147,  85, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ' ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    'IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop:
        MOVE G6D,95,  90, 125, 95, 104
        MOVE G6A,104,  76, 145,  91,  102
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6D,95,  95, 120, 100, 104
    MOVE G6A,104,  77, 147,  93,  102
    MOVE G6C, 85
    MOVE G6B,115
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5:
    MOVE G6D,103,    73, 140, 103,  100
    MOVE G6A, 95,  85, 147,  85, 102
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ' ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    ' IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop:
        MOVE G6A,95,  90, 125, 95, 104
        MOVE G6D,104,  76, 145,  91,  102
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

ï¿½È±ï¿½:


    '*************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    
    
=======
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    
    
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    
    
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    '*********************************

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1

    '******************************************
    '******************************************
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  76, 145,  93, 98
        MOVE G6B,101
        MOVE G6C,101
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 145,  93, 101
        MOVE G6A,101,  76, 145,  93, 98
        MOVE G6B,101
        MOVE G6C,101
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6D,104,  76, 147,  93,  102
    MOVE G6A,95,  95, 120, 95, 104
    MOVE G6B,116
    MOVE G6C,86
    WAIT



ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    MOVE G6A, 103,  79, 147,  89, 100
    MOVE G6D,95,   65, 147, 103,  102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop
    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop:
        MOVE G6D,95,  85, 130, 100, 104
        MOVE G6A,104,  77, 146,  93,  102
        MOVE G6C, 101
        MOVE G6B,101
        WAIT

        'SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        HIGHSPEED SETOFF
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6A,104,  76, 147,  93,  102
    MOVE G6D,95,  95, 120, 95, 104
    MOVE G6C,116
    MOVE G6B,86
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6:
    MOVE G6D, 103,  79, 147,  89, 100
    MOVE G6A,95,   65, 147, 103,  102
    WAIT
    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN  'GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop:
        MOVE G6A,95,  85, 130, 100, 104
        MOVE G6D,104,  77, 146,  93,  102
        MOVE G6B, 101
        MOVE G6C,101
        WAIT

        'SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        HIGHSPEED SETOFF
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1




    '******************************************


    '******************************************
    '******************************************

    '******************************************
    '*************************************

    '******************************************
ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 2
    SPEED 10
    HIGHSPEED SETON
    GOSUB All_motor_mode3


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  77, 145,  93, 98
        MOVE G6B,100,  35
        MOVE G6C,100,  35
        WAIT

        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 145,  93, 101
        MOVE G6A,101,  77, 145,  93, 98
        MOVE G6B,100,  35
        MOVE G6C,100,  35
        WAIT

        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF



    '**********************

ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    SPEED 8
    MOVE G6A,95,  95, 120, 100, 104
    MOVE G6D,104,  77, 146,  91,  102
    MOVE G6B, 85
    MOVE G6C,115
    WAIT


ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    SPEED 8
    MOVE G6A,103,   71, 140, 105,  100
    MOVE G6D, 95,  82, 146,  87, 102
    WAIT


    ERX 4800, A ,ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4_0

    IF A = 20 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 3
    ELSEIF A = 43 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 1
    ELSEIF A = 11 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 2
    ELSE  'ï¿½ï¿½ï¿½ï¿½
        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3ï¿½ï¿½ï¿½ï¿½
    ENDIF

ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4_0:

    IF  ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 1 THEN'ï¿½ï¿½ï¿½ï¿½

    ELSEIF  ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 3 THEN'ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
        HIGHSPEED SETOFF
        SPEED 8
        MOVE G6D,103,   71, 140, 105,  100
        MOVE G6A, 95,  82, 146,  87, 102
        WAIT
        HIGHSPEED SETON
        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1

    ENDIF



    '*********************************

ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    SPEED 8
    MOVE G6D,95,  95, 120, 100, 104
    MOVE G6A,104,  77, 146,  91,  102
    MOVE G6C, 85
    MOVE G6B,115
    WAIT


ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6:
    SPEED 8
    MOVE G6D,103,   71, 140, 105,  100
    MOVE G6A, 95,  82, 146,  87, 102
    WAIT



    ERX 4800, A ,ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1_0

    IF A = 20 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 3
    ELSEIF A = 43 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 1
    ELSEIF A = 11 THEN
        ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 2
    ELSE  'ï¿½ï¿½ï¿½ï¿½
        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6ï¿½ï¿½ï¿½ï¿½
    ENDIF

ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1_0:

    IF  ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 1 THEN'ï¿½ï¿½ï¿½ï¿½
        HIGHSPEED SETOFF
        SPEED 8
        MOVE G6A,103,   71, 140, 105,  100
        MOVE G6D, 95,  82, 146,  87, 102
        WAIT
        HIGHSPEED SETON
        GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ELSEIF ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ = 3 THEN'ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½


    ENDIF



    GOTO ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    '******************************************
    '******************************************
    '*********************************
ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3ï¿½ï¿½ï¿½ï¿½:
    MOVE G6D,95,  90, 125, 95, 104
    MOVE G6A,104,  76, 145,  91,  102
    MOVE G6C, 100
    MOVE G6B,100
    WAIT
    HIGHSPEED SETOFF
    SPEED 15
    GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    GOTO MAIN	
    '******************************************
ï¿½î¼±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6ï¿½ï¿½ï¿½ï¿½:
    MOVE G6A,95,  90, 125, 95, 104
    MOVE G6D,104,  76, 145,  91,  102
    MOVE G6B, 100
    MOVE G6C,100
    WAIT
    HIGHSPEED SETOFF
    SPEED 15
    GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    GOTO MAIN	
    '******************************************

    '************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20: '****
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

    SPEED 12
    MOVE G6D, 95,  90, 125, 100, 109, 100
    MOVE G6A,105,  78, 146,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6D, 102,  77, 145, 93, 100, 100
    MOVE G6A,90,  82, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6D,95,  76, 145,  93, 102, 100
    MOVE G6A,95,  78, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  78, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT
    GOSUB All_motor_mode3
    GOTO RX_EXIT
    '*************
    '*************

ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20: '****
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

    SPEED 12
    MOVE G6A, 95,  90, 125, 100, 109, 100 ' before 95, 90, 125, 100, 104, 100
    MOVE G6D,105,  78, 145,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6A, 102,  77, 145, 93, 100, 100
    MOVE G6D,90,  82, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6A,95,  76, 145,  93, 102, 100
    MOVE G6D,95,  78, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  78, 145,  93, 100, 100
    GOSUB All_motor_mode3
    GOTO RX_EXIT

    '**********************************************
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop:
    DELAY  10

    SPEED 10
    MOVE G6D, 90,  90, 120, 105, 110, 100
    MOVE G6A,100,  76, 145,  93, 107, 100
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6D, 102,  76, 145, 95, 100, 100
    MOVE G6A,83,  78, 140,  98, 115, 100
    WAIT

    SPEED 13
    MOVE G6D,98,  76, 145,  95, 100, 100
    MOVE G6A,98,  76, 145,  95, 100, 100
    WAIT

    SPEED 12
    MOVE G6A,100,  76, 145,  95, 100, 100
    MOVE G6D,100,  76, 145,  95, 100, 100
    WAIT


    '  ERX 4800, A ,ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    '    IF A = A_OLD THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    'ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_stop:
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT
    '**********************************************

ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop:
    DELAY  10

    SPEED 10
    MOVE G6A, 90,  90, 120, 105, 110, 100	
    MOVE G6D,100,  76, 145,  93, 107, 100	
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6A, 102,  76, 145, 95, 100, 100
    MOVE G6D,83,  78, 140,  98, 115, 100
    WAIT

    SPEED 13
    MOVE G6A,98,  76, 145,  95, 100, 100
    MOVE G6D,98,  76, 145,  95, 100, 100
    WAIT

    SPEED 12
    MOVE G6D,100,  76, 145,  95, 100, 100
    MOVE G6A,100,  76, 145,  93, 100, 100
    WAIT

    '   ERX 4800, A ,ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop	
    '    IF A = A_OLD THEN  GOTO ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    'ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_stop:

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT

    '**********************************************
    '************************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
=======
>>>>>>> 7bd10b6 (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)
    '*********************************************

    'Á»´õ °­ÇÏ°Ô ¿·À¸·Î °¡´Â ÇÔ¼ö(¹®¿­¶§ »ç¿ë)
¿À¸¥ÂÊ¿·À¸·Î°È±â:

    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    GOSUB All_motor_Reset
    DELAY  10

    SPEED 7
    MOVE G6D, 90,  90, 120, 105, 110, 100
    MOVE G6A,100,  76, 145,  93, 107, 100
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6D, 102,  76, 145, 93, 100, 100
    MOVE G6A,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6D,98,  76, 145,  93, 100, 100
    MOVE G6A,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT


    SPEED 5

    RETURN


¿ÞÂÊ¿·À¸·Î°È±â:

    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    GOSUB All_motor_Reset
    DELAY  10

    SPEED 7
    MOVE G6A, 90,  90, 120, 105, 110, 100
    MOVE G6D,100,  76, 145,  93, 107, 100
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6A, 102,  76, 145, 93, 100, 100
    MOVE G6D,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6A,98,  76, 145,  93, 100, 100
    MOVE G6D,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6A,100,  76, 145,  93, 100, 100
    WAIT


    SPEED 5

    RETURN

¹®¿­±âµ¿ÀÛ:
    SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 200

    RETURN


¹®¿­±âµ¿ÀÛ2:
    SPEED 5

    MOVE G6B,130,  90, 10
    MOVE G6C,100, 190 , 10	
    WAIT

    DELAY 200

    RETURN
    '*******************************
¹®¿­±â°È±â:
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    SPEED 7
    HIGHSPEED SETON


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  77, 147,  93, 101
        MOVE G6D,101,  76, 149,  93, 98
        WAIT

        GOTO ¹®¿­±â°È±â_1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 149,  93, 101
        MOVE G6A,101,  77, 147,  93, 98
        WAIT

        GOTO ¹®¿­±â°È±â_4
    ENDIF


    '**********************

¹®¿­±â°È±â_1:
    MOVE G6A,95,  91, 125, 100, 104
    MOVE G6D,104,  77, 149,  93,  102
    WAIT


¹®¿­±â°È±â_2:

    MOVE G6A,103,   74, 140, 103,  100
    MOVE G6D, 95,  85, 149,  85, 102
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0

        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­±â°È±â_2_stop

    ERX 4800,A, ¹®¿­±â°È±â_4
    IF A <> A_old THEN
¹®¿­±â°È±â_2_stop:
        MOVE G6D,95,  90, 127, 95, 104
        MOVE G6A,104,  77, 145,  91,  102
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        'GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        ' SPEED 5
        '  GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  75, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

¹®¿­±â°È±â_4:
    MOVE G6D,95,  96, 122, 100, 104
    MOVE G6A,104,  78, 147,  93,  102
    WAIT


¹®¿­±â°È±â_5:
    MOVE G6D,103,    74, 142, 103,  100
    MOVE G6A, 95,  86, 147,  85, 102
    WAIT


    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­±â°È±â_5_stop

    ERX 4800,A, ¹®¿­±â°È±â_1
    IF A <> A_old THEN
¹®¿­±â°È±â_5_stop:
        MOVE G6A,95,  91, 125, 95, 104
        MOVE G6D,104,  79, 145,  91,  102
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        '   GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        '  SPEED 5
        ' GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  75, 145,  93, 100, 100
        MOVE G6D,100,  77, 145,  93, 100, 100

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*************************************

    '*********************************

    GOTO ¹®¿­±â°È±â_1

¹®¿­±â°È±âÈÄÁø:
    GOSUB All_motor_mode3
    ³Ñ¾îÁøÈ®ÀÎ = 0
    º¸ÇàCOUNT = 0
    SPEED 7
    'HIGHSPEED SETON


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  77, 145,  93, 101
        MOVE G6D,101,  76, 145,  93, 98
        WAIT

        GOTO ¹®¿­±â°È±âÈÄÁø_1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 145,  93, 101
        MOVE G6A,101,  76, 145,  93, 98
        WAIT

        GOTO ¹®¿­±â°È±âÈÄÁø_4
    ENDIF


    '**********************

¹®¿­±â°È±âÈÄÁø_1:
    MOVE G6D,104,  76, 147,  93,  102
    MOVE G6A,95,  95, 120, 95, 104
    WAIT



¹®¿­±â°È±âÈÄÁø_3:
    MOVE G6A, 103,  79, 147,  89, 100
    MOVE G6D,95,   65, 147, 103,  102
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF
    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­±â°È±âÈÄÁø_3_stop
    ERX 4800,A, ¹®¿­±â°È±âÈÄÁø_4
    IF A <> A_old THEN
¹®¿­±â°È±âÈÄÁø_3_stop:
        MOVE G6D,95,  85, 130, 100, 104
        MOVE G6A,104,  77, 146,  93,  102
        WAIT

        'SPEED 15
        '        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  76, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        '   DELAY 400
        GOTO RX_EXIT
    ENDIF
    '*********************************

¹®¿­±â°È±âÈÄÁø_4:
    MOVE G6A,104,  76, 147,  93,  102
    MOVE G6D,95,  95, 120, 95, 104
    WAIT


¹®¿­±â°È±âÈÄÁø_6:
    MOVE G6D, 103,  79, 147,  89, 100
    MOVE G6A,95,   65, 147, 103,  102
    WAIT
    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­±â°È±âÈÄÁø_6_stop

    ERX 4800,A, ¹®¿­±â°È±âÈÄÁø_1
    IF A <> A_old THEN  'GOTO ¹®¿­±â°È±âÈÄÁø_¸ØÃã
¹®¿­±â°È±âÈÄÁø_6_stop:
        MOVE G6A,95,  85, 130, 100, 104
        MOVE G6D,104,  77, 146,  93,  102
        WAIT

        'SPEED 15
        '        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  76, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        '  DELAY 400
        GOTO RX_EXIT
    ENDIF

    GOTO ¹®¿­±â°È±âÈÄÁø_1

¹®¿­±â¿ÞÂÊ3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

¹®¿­±â¿ÞÂÊ3_LOOP:
    'SPEED 5

    'MOVE G6B,130,  90, 10
    'MOVE G6C,100, 190 , 10	
    'WAIT

    ' DELAY 150
    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        SPEED 15
        MOVE G6D,100,  73, 145,  91, 100, 100
        MOVE G6A,100,  79, 145,  91, 100, 100
        WAIT

        SPEED 6
        MOVE G6D,100,  84, 145,  76, 100, 100
        MOVE G6A,100,  68, 145,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,90,  90, 145,  76, 102, 100
        MOVE G6A,104,  71, 145,  103, 100, 100
        WAIT
        SPEED 7
        MOVE G6D,90,  80, 128, 102, 104
        MOVE G6A,105,  76, 144,  93,  100
        WAIT



    ELSE
        º¸Çà¼ø¼­ = 0
        SPEED 15
        MOVE G6D,100,  73, 145,  91, 100, 100
        MOVE G6A,100,  79, 145,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6D,100,  88, 145,  76, 100, 100
        MOVE G6A,100,  65, 145,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,104,  86, 146,  78, 100, 100
        MOVE G6A,90,  58, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  85, 128, 98, 104
        MOVE G6D,105,  77, 144,  93,  100
        WAIT


    ENDIF

    SPEED 12
    ' GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  91, 100, 100
    MOVE G6D,100,  76, 145,  91, 100, 100


    GOTO RX_EXIT

¹®¿­±â¿À¸¥ÂÊ3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

¹®¿­±â¿À¸¥ÂÊ3_LOOP:
    '   MOVE G6C,130,  90, 10
    '  MOVE G6B,100, 190 , 10	
    ' WAIT
    'DELAY 150
    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        SPEED 15
        MOVE G6A,100,  73, 145,  91, 100, 100
        MOVE G6D,98,  79, 146,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  84, 145,  76, 100, 100
        MOVE G6D,98,  68, 146,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,90,  90, 145,  76, 102, 100
        MOVE G6D,102  71, 146,  103, 100, 100
        WAIT
        SPEED 7
        MOVE G6A,90,  80, 128, 102, 104
        MOVE G6D,103,  76, 145,  93,  100
        WAIT



    ELSE
        º¸Çà¼ø¼­ = 0
        SPEED 15
        MOVE G6A,100,  73, 145,  91, 100, 100
        MOVE G6D,98,  79, 146,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  88, 145,  76, 100, 100
        MOVE G6D,98,  65, 146,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,104,  86, 146,  78, 100, 100
        MOVE G6D,88,  58, 146,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,88,  85, 129, 98, 104
        MOVE G6A,105,  77, 143,  93,  100
        WAIT

    ENDIF
    SPEED 12
    '  GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  91, 100, 100
    MOVE G6D,100,  76, 145,  91, 100, 100

    GOTO RX_EXIT

¹®¿­±â¿ÞÂÊ3_LOOP_°íÁ¤:
    SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 150
    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        SPEED 15
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT

        SPEED 6
        MOVE G6D,100,  84, 145,  78, 100, 100
        MOVE G6A,100,  68, 145,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,90,  90, 145,  78, 102, 100
        MOVE G6A,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 7
        MOVE G6D,90,  80, 130, 102, 104
        MOVE G6A,105,  76, 146,  93,  100
        WAIT



    ELSE
        º¸Çà¼ø¼­ = 0
        SPEED 15
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6D,100,  88, 145,  78, 100, 100
        MOVE G6A,100,  65, 145,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,104,  86, 146,  80, 100, 100
        MOVE G6A,90,  58, 145,  110, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  85, 130, 98, 104
        MOVE G6D,105,  77, 146,  93,  100
        WAIT



    ENDIF

    SPEED 12
    ' GOSUB ±âº»ÀÚ¼¼2


    GOTO RX_EXIT

¹®¿­±â¿À¸¥ÂÊ3_LOOP_°íÁ¤:
    '  SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 150
    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        SPEED 15
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  84, 145,  78, 100, 100
        MOVE G6D,98,  68, 146,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,90,  90, 145,  78, 102, 100
        MOVE G6D,102  71, 146,  105, 100, 100
        WAIT
        SPEED 7
        MOVE G6A,90,  80, 130, 102, 104
        MOVE G6D,103,  76, 147,  93,  100
        WAIT



    ELSE
        º¸Çà¼ø¼­ = 0
        SPEED 15
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  88, 145,  78, 100, 100
        MOVE G6D,98,  65, 146,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,104,  86, 146,  80, 100, 100
        MOVE G6D,88,  58, 146,  110, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,88,  85, 131, 98, 104
        MOVE G6A,105,  77, 145,  93,  100
        WAIT

    ENDIF
    SPEED 12
    '  GOSUB ±âº»ÀÚ¼¼2

    GOTO RX_EXIT


>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> e888a3d (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)
=======
    '*********************************************
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)

    'ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½Ï°ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½Ô¼ï¿½(ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½)
ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½Î°È±ï¿½:

    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    GOSUB All_motor_Reset
    DELAY  10

    SPEED 7
    MOVE G6D, 90,  90, 120, 105, 110, 100
    MOVE G6A,100,  76, 145,  93, 107, 100
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6D, 102,  76, 145, 93, 100, 100
    MOVE G6A,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6D,98,  76, 145,  93, 100, 100
    MOVE G6A,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT


    SPEED 5

    RETURN


ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½Î°È±ï¿½:

    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    GOSUB All_motor_Reset
    DELAY  10

    SPEED 7
    MOVE G6A, 90,  90, 120, 105, 110, 100
    MOVE G6D,100,  76, 145,  93, 107, 100
    'MOVE G6C,100,  40
    'MOVE G6B,100,  40
    WAIT

    SPEED 13
    MOVE G6A, 102,  76, 145, 93, 100, 100
    MOVE G6D,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6A,98,  76, 145,  93, 100, 100
    MOVE G6D,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6A,100,  76, 145,  93, 100, 100
    WAIT


    SPEED 5

    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½âµ¿ï¿½ï¿½:
    SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 200

    RETURN


ï¿½ï¿½ï¿½ï¿½ï¿½âµ¿ï¿½ï¿½2:
    SPEED 5

    MOVE G6B,130,  90, 10
    MOVE G6C,100, 190 , 10	
    WAIT

    DELAY 200

    RETURN
    '*******************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½:
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  77, 147,  93, 101
        MOVE G6D,101,  76, 149,  93, 98
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 149,  93, 101
        MOVE G6A,101,  77, 147,  93, 98
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1:
    MOVE G6A,95,  91, 125, 100, 104
    MOVE G6D,104,  77, 149,  93,  102
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2:

    MOVE G6A,103,   74, 140, 103,  100
    MOVE G6D, 95,  85, 149,  85, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_stop:
        MOVE G6D,95,  90, 127, 95, 104
        MOVE G6A,104,  77, 145,  91,  102
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        'GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        ' SPEED 5
        '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  75, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_4:
    MOVE G6D,95,  96, 122, 100, 104
    MOVE G6A,104,  78, 147,  93,  102
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_5:
    MOVE G6D,103,    74, 142, 103,  100
    MOVE G6A, 95,  86, 147,  85, 102
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_5_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_5_stop:
        MOVE G6A,95,  91, 125, 95, 104
        MOVE G6D,104,  79, 145,  91,  102
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        '   GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '  SPEED 5
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  75, 145,  93, 100, 100
        MOVE G6D,100,  77, 145,  93, 100, 100

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*************************************

    '*********************************

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    'HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  77, 145,  93, 101
        MOVE G6D,101,  76, 145,  93, 98
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 145,  93, 101
        MOVE G6A,101,  76, 145,  93, 98
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6D,104,  76, 147,  93,  102
    MOVE G6A,95,  95, 120, 95, 104
    WAIT



ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    MOVE G6A, 103,  79, 147,  89, 100
    MOVE G6D,95,   65, 147, 103,  102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop
    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop:
        MOVE G6D,95,  85, 130, 100, 104
        MOVE G6A,104,  77, 146,  93,  102
        WAIT

        'SPEED 15
        '        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  76, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        '   DELAY 400
        GOTO RX_EXIT
    ENDIF
    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6A,104,  76, 147,  93,  102
    MOVE G6D,95,  95, 120, 95, 104
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_6:
    MOVE G6D, 103,  79, 147,  89, 100
    MOVE G6A,95,   65, 147, 103,  102
    WAIT
    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN  'GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop:
        MOVE G6A,95,  85, 130, 100, 104
        MOVE G6D,104,  77, 146,  93,  102
        WAIT

        'SPEED 15
        '        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  76, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100

        '  DELAY 400
        GOTO RX_EXIT
    ENDIF

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½ï¿½ï¿½ï¿½ï¿½_1

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:
    'SPEED 5

    'MOVE G6B,130,  90, 10
    'MOVE G6C,100, 190 , 10	
    'WAIT

    ' DELAY 150
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 15
        MOVE G6D,100,  73, 145,  91, 100, 100
        MOVE G6A,100,  79, 145,  91, 100, 100
        WAIT

        SPEED 6
        MOVE G6D,100,  84, 145,  76, 100, 100
        MOVE G6A,100,  68, 145,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,90,  90, 145,  76, 102, 100
        MOVE G6A,104,  71, 145,  103, 100, 100
        WAIT
        SPEED 7
        MOVE G6D,90,  80, 128, 102, 104
        MOVE G6A,105,  76, 144,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 15
        MOVE G6D,100,  73, 145,  91, 100, 100
        MOVE G6A,100,  79, 145,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6D,100,  88, 145,  76, 100, 100
        MOVE G6A,100,  65, 145,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,104,  86, 146,  78, 100, 100
        MOVE G6A,90,  58, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  85, 128, 98, 104
        MOVE G6D,105,  77, 144,  93,  100
        WAIT


    ENDIF

    SPEED 12
    ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  91, 100, 100
    MOVE G6D,100,  76, 145,  91, 100, 100


    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:
    '   MOVE G6C,130,  90, 10
    '  MOVE G6B,100, 190 , 10	
    ' WAIT
    'DELAY 150
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 15
        MOVE G6A,100,  73, 145,  91, 100, 100
        MOVE G6D,98,  79, 146,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  84, 145,  76, 100, 100
        MOVE G6D,98,  68, 146,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,90,  90, 145,  76, 102, 100
        MOVE G6D,102  71, 146,  103, 100, 100
        WAIT
        SPEED 7
        MOVE G6A,90,  80, 128, 102, 104
        MOVE G6D,103,  76, 145,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 15
        MOVE G6A,100,  73, 145,  91, 100, 100
        MOVE G6D,98,  79, 146,  91, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  88, 145,  76, 100, 100
        MOVE G6D,98,  65, 146,  106, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,104,  86, 146,  78, 100, 100
        MOVE G6D,88,  58, 146,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,88,  85, 129, 98, 104
        MOVE G6A,105,  77, 143,  93,  100
        WAIT

    ENDIF
    SPEED 12
    '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  91, 100, 100
    MOVE G6D,100,  76, 145,  91, 100, 100

    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP_ï¿½ï¿½ï¿½ï¿½:
    SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 150
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 15
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT

        SPEED 6
        MOVE G6D,100,  84, 145,  78, 100, 100
        MOVE G6A,100,  68, 145,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,90,  90, 145,  78, 102, 100
        MOVE G6A,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 7
        MOVE G6D,90,  80, 130, 102, 104
        MOVE G6A,105,  76, 146,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 15
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6D,100,  88, 145,  78, 100, 100
        MOVE G6A,100,  65, 145,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,104,  86, 146,  80, 100, 100
        MOVE G6A,90,  58, 145,  110, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  85, 130, 98, 104
        MOVE G6D,105,  77, 146,  93,  100
        WAIT



    ENDIF

    SPEED 12
    ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2


    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP_ï¿½ï¿½ï¿½ï¿½:
    '  SPEED 5

    MOVE G6C,130,  90, 10
    MOVE G6B,100, 190 , 10	
    WAIT

    DELAY 150
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 15
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  84, 145,  78, 100, 100
        MOVE G6D,98,  68, 146,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,90,  90, 145,  78, 102, 100
        MOVE G6D,102  71, 146,  105, 100, 100
        WAIT
        SPEED 7
        MOVE G6A,90,  80, 130, 102, 104
        MOVE G6D,103,  76, 147,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 15
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 6
        MOVE G6A,100,  88, 145,  78, 100, 100
        MOVE G6D,98,  65, 146,  108, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,104,  86, 146,  80, 100, 100
        MOVE G6D,88,  58, 146,  110, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,88,  85, 131, 98, 104
        MOVE G6A,105,  77, 145,  93,  100
        WAIT

    ENDIF
    SPEED 12
    '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT


=======
>>>>>>> e888a3d (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 17
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT

        SPEED 8
        MOVE G6D,100,  84, 145,  78, 100, 100
        MOVE G6A,100,  68, 145,  108, 100, 100
        WAIT

        SPEED 11
        MOVE G6D,90,  90, 145,  78, 102, 100
        MOVE G6A,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 9
        MOVE G6D,90,  80, 130, 102, 104
        MOVE G6A,105,  76, 146,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 17
        MOVE G6D,100,  73, 145,  93, 100, 100
        MOVE G6A,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 8
        MOVE G6D,100,  88, 145,  78, 100, 100
        MOVE G6A,100,  65, 145,  108, 100, 100
        WAIT

        SPEED 11
        MOVE G6D,104,  86, 146,  80, 100, 100
        MOVE G6A,90,  58, 145,  110, 100, 100
        WAIT

        SPEED 9
        MOVE G6A,90,  85, 130, 98, 104
        MOVE G6D,105,  77, 146,  93,  100
        WAIT



    ENDIF

    SPEED 14
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2


    GOTO RX_EXIT

    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 17
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 8
        MOVE G6A,100,  84, 145,  78, 100, 100
        MOVE G6D,98,  68, 146,  108, 100, 100
        WAIT

        SPEED 11
        MOVE G6A,90,  90, 145,  78, 102, 100
        MOVE G6D,102  71, 146,  105, 100, 100
        WAIT
        SPEED 9
        MOVE G6A,90,  80, 130, 102, 104
        MOVE G6D,103,  76, 147,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 15
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,98,  79, 146,  93, 100, 100
        WAIT


        SPEED 8
        MOVE G6A,100,  88, 145,  78, 100, 100
        MOVE G6D,98,  65, 146,  108, 100, 100
        WAIT

        SPEED 11
        MOVE G6A,104,  86, 146,  80, 100, 100
        MOVE G6D,88,  58, 146,  110, 100, 100
        WAIT

        SPEED 9
        MOVE G6D,88,  85, 131, 98, 104
        MOVE G6A,105,  77, 145,  93,  100
        WAIT

    ENDIF
    SPEED 14
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT

    '******************************************************
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 5
    MOVE G6A,97,  86, 145,  83, 103, 100
    MOVE G6D,97,  66, 145,  103, 103, 100
    WAIT

    SPEED 12
    MOVE G6A,94,  86, 145,  83, 101, 100
    MOVE G6D,94,  66, 145,  103, 101, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100
    WAIT

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 5
    MOVE G6A,97,  66, 145,  103, 103, 100
    MOVE G6D,97,  86, 145,  83, 103, 100
    WAIT

    SPEED 12
    MOVE G6A,94,  66, 145,  103, 101, 100
    MOVE G6D,94,  86, 145,  83, 101, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100
    WAIT

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT
    '**********************************************
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  96, 145,  73, 105, 100
    MOVE G6D,95,  56, 145,  113, 105, 100
    MOVE G6B,110
    MOVE G6C,90
    WAIT

    SPEED 12
    MOVE G6A,93,  96, 145,  73, 105, 100
    MOVE G6D,93,  56, 145,  113, 105, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  56, 145,  113, 105, 100
    MOVE G6D,95,  96, 145,  73, 105, 100
    MOVE G6B,90
    MOVE G6C,110
    WAIT

    SPEED 12
    MOVE G6A,93,  56, 145,  113, 105, 100
    MOVE G6D,93,  96, 145,  73, 105, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

    GOTO RX_EXIT
    '**********************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
¹®¿­°í¿À¸¥ÂÊÅÏ20:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  56, 145,  113, 105, 100
    MOVE G6D,95,  96, 145,  73, 105, 100
    '  MOVE G6B,90
    ' MOVE G6C,110
    WAIT

    SPEED 12
    MOVE G6A,93,  56, 145,  113, 105, 100
    MOVE G6D,93,  96, 145,  73, 105, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    '  GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT
    '**********************************************	

¹®¿­°í¿ÞÂÊÅÏ20:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  96, 145,  73, 105, 100
    MOVE G6D,95,  56, 145,  113, 105, 100
    'MOVE G6B,110
    'MOVE G6C,90
    WAIT

    SPEED 12
    MOVE G6A,93,  96, 145,  73, 105, 100
    MOVE G6D,93,  56, 145,  113, 105, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    'GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT

¹®¿­°í¿ÞÂÊÅÏ45:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 10
    MOVE G6A,95, 106, 145,  63, 105, 100
    MOVE G6D,95,  46, 145,  123, 105, 100
    'MOVE G6B,110
    'MOVE G6C,90
    WAIT

    SPEED 12
    MOVE G6A,93,  106, 145,  63, 105, 100
    MOVE G6D,93,  46, 145,  123, 105, 100
    WAIT
    SPEED 8
    '   MOVE G6A,101,  76, 146,  93, 98, 100
    '  MOVE G6D,101,  76, 146,  93, 98, 100

    '  WAIT

    'GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT

¹®¿­°í¿À¸¥ÂÊÅÏ45:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 10
    MOVE G6A,95,  46, 145,  123, 105, 100
    MOVE G6D,95,  106, 145,  63, 105, 100
    '  MOVE G6B,90
    ' MOVE G6C,110
    WAIT

    SPEED 12
    MOVE G6A,93,  46, 145,  123, 105, 100
    MOVE G6D,93,  106, 145,  63, 105, 100
    WAIT

    SPEED 8
    ' MOVE G6A,101,  76, 146,  93, 98, 100
    'MOVE G6D,101,  76, 146,  93, 98, 100

    'WAIT

    '  GOSUB ±âº»ÀÚ¼¼2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT
    '**********************************************
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> e888a3d (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)
¿ÞÂÊÅÏ45:
=======
=======
>>>>>>> 7bd10b6 (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  56, 145,  113, 105, 100
    MOVE G6D,95,  96, 145,  73, 105, 100
    '  MOVE G6B,90
    ' MOVE G6C,110
    WAIT

    SPEED 12
    MOVE G6A,93,  56, 145,  113, 105, 100
    MOVE G6D,93,  96, 145,  73, 105, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT
    '**********************************************	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 8
    MOVE G6A,95,  96, 145,  73, 105, 100
    MOVE G6D,95,  56, 145,  113, 105, 100
    'MOVE G6B,110
    'MOVE G6C,90
    WAIT

    SPEED 12
    MOVE G6A,93,  96, 145,  73, 105, 100
    MOVE G6D,93,  56, 145,  113, 105, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  93, 98, 100
    MOVE G6D,101,  76, 146,  93, 98, 100

    WAIT

    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 10
    MOVE G6A,95, 106, 145,  63, 105, 100
    MOVE G6D,95,  46, 145,  123, 105, 100
    'MOVE G6B,110
    'MOVE G6C,90
    WAIT

    SPEED 12
    MOVE G6A,93,  106, 145,  63, 105, 100
    MOVE G6D,93,  46, 145,  123, 105, 100
    WAIT
    SPEED 8
    '   MOVE G6A,101,  76, 146,  93, 98, 100
    '  MOVE G6D,101,  76, 146,  93, 98, 100

    '  WAIT

    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    SPEED 10
    MOVE G6A,95,  46, 145,  123, 105, 100
    MOVE G6D,95,  106, 145,  63, 105, 100
    '  MOVE G6B,90
    ' MOVE G6C,110
    WAIT

    SPEED 12
    MOVE G6A,93,  46, 145,  123, 105, 100
    MOVE G6D,93,  106, 145,  63, 105, 100
    WAIT

    SPEED 8
    ' MOVE G6A,101,  76, 146,  93, 98, 100
    'MOVE G6D,101,  76, 146,  93, 98, 100

    'WAIT

    '  GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:
=======
¿ÞÂÊÅÏ45:
>>>>>>> e888a3d (Chore: ë¬¸ ëª¨ì…˜ ì‚­ì œ)
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP:

    SPEED 10
    MOVE G6A,95,  106, 145,  63, 105, 100
    MOVE G6D,95,  46, 145,  123, 105, 100
    WAIT

    SPEED 12
    MOVE G6A,93,  106, 145,  63, 105, 100
    MOVE G6D,93,  46, 145,  123, 105, 100
    WAIT

    SPEED 8
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    'DELAY 50
    '    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    '    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
    '        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    '        GOTO RX_EXIT
    '    ENDIF
    '
    '    ERX 4800,A,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP
    '    IF A_old = A THEN GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP
    '
    GOTO RX_EXIT

    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP:

    SPEED 10
    MOVE G6A,95,  46, 145,  123, 105, 100
    MOVE G6D,95,  106, 145,  63, 105, 100
    WAIT

    SPEED 12
    MOVE G6A,93,  46, 145,  123, 105, 100
    MOVE G6D,93,  106, 145,  63, 105, 100
    WAIT

    SPEED 8
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    ' DELAY 50
    '    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    '    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
    '        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    '        GOTO RX_EXIT
    '    ENDIF
    '
    '    ERX 4800,A,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP
    '    IF A_old = A THEN GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45_LOOP
    '
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP:

    SPEED 15
    MOVE G6A,95,  116, 145,  53, 105, 100
    MOVE G6D,95,  36, 145,  133, 105, 100
    WAIT

    SPEED 15
    MOVE G6A,90,  116, 145,  53, 105, 100
    MOVE G6D,90,  36, 145,  133, 105, 100
    WAIT

    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    '  DELAY 50
    '    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    '    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
    '        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    '        GOTO RX_EXIT
    '    ENDIF
    '    ERX 4800,A,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP
    '    IF A_old = A THEN GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP

    GOTO RX_EXIT

    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP:

    SPEED 15
    MOVE G6A,95,  36, 145,  133, 105, 100
    MOVE G6D,95,  116, 145,  53, 105, 100
    WAIT

    SPEED 15
    MOVE G6A,90,  36, 145,  133, 105, 100
    MOVE G6D,90,  116, 145,  53, 105, 100

    WAIT

    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    ' DELAY 50
    '    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    '    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
    '        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    '        GOTO RX_EXIT
    '    ENDIF
    '    ERX 4800,A,ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP
    '    IF A_old = A THEN GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60_LOOP

    GOTO RX_EXIT
    '****************************************
    '************************************************
    '**********************************************


    '************************************************

    ''************************************************
    '************************************************
    '************************************************
ï¿½Ú·ï¿½ï¿½Ï¾î³ªï¿½ï¿½:

    HIGHSPEED SETOFF
    PTP SETON 				
    PTP ALLON		

    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½OFF

    GOSUB All_motor_Reset

    SPEED 15
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½

    MOVE G6A,90, 130, ,  80, 110, 100
    MOVE G6D,90, 130, 120,  80, 110, 100
    MOVE G6B,150, 160,  10, 100, 100, 100
    MOVE G6C,150, 160,  10, 100, 100, 100
    WAIT

    MOVE G6B,170, 140,  10, 100, 100, 100
    MOVE G6C,170, 140,  10, 100, 100, 100
    WAIT

    MOVE G6B,185,  20, 70,  100, 100, 100
    MOVE G6C,185,  20, 70,  100, 100, 100
    WAIT
    SPEED 10
    MOVE G6A, 80, 155,  85, 150, 150, 100
    MOVE G6D, 80, 155,  85, 150, 150, 100
    MOVE G6B,185,  20, 70,  100, 100, 100
    MOVE G6C,185,  20, 70,  100, 100, 100
    WAIT



    MOVE G6A, 75, 162,  55, 162, 155, 100
    MOVE G6D, 75, 162,  59, 162, 155, 100
    MOVE G6B,188,  10, 100, 100, 100, 100
    MOVE G6C,188,  10, 100, 100, 100, 100
    WAIT

    SPEED 10
    MOVE G6A, 60, 162,  30, 162, 145, 100
    MOVE G6D, 60, 162,  30, 162, 145, 100
    MOVE G6B,170,  10, 100, 100, 100, 100
    MOVE G6C,170,  10, 100, 100, 100, 100
    WAIT
    GOSUB Leg_motor_mode3	
    MOVE G6A, 60, 150,  28, 155, 140, 100
    MOVE G6D, 60, 150,  28, 155, 140, 100
    MOVE G6B,150,  60,  90, 100, 100, 100
    MOVE G6C,150,  60,  90, 100, 100, 100
    WAIT

    MOVE G6A,100, 150,  28, 140, 100, 100
    MOVE G6D,100, 150,  28, 140, 100, 100
    MOVE G6B,130,  50,  85, 100, 100, 100
    MOVE G6C,130,  50,  85, 100, 100, 100
    WAIT
    DELAY 100

    MOVE G6A,100, 150,  33, 140, 100, 100
    MOVE G6D,100, 150,  33, 140, 100, 100
    WAIT
    SPEED 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½

    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1

    DELAY 200
    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½ON

    RETURN


    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ï¾î³ªï¿½ï¿½:


    HIGHSPEED SETOFF
    PTP SETON 				
    PTP ALLON

    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½OFF

    HIGHSPEED SETOFF

    GOSUB All_motor_Reset

    SPEED 15
    MOVE G6A,100, 15,  70, 140, 100,
    MOVE G6D,100, 15,  70, 140, 100,
    MOVE G6B,20,  140,  15
    MOVE G6C,20,  140,  15
    WAIT

    SPEED 12
    MOVE G6A,100, 136,  35, 80, 100,
    MOVE G6D,100, 136,  35, 80, 100,
    MOVE G6B,20,  30,  80
    MOVE G6C,20,  30,  80
    WAIT

    SPEED 12
    MOVE G6A,100, 165,  70, 30, 100,
    MOVE G6D,100, 165,  70, 30, 100,
    MOVE G6B,30,  20,  95
    MOVE G6C,30,  20,  95
    WAIT

    GOSUB Leg_motor_mode3

    SPEED 10
    MOVE G6A,100, 165,  45, 90, 100,
    MOVE G6D,100, 165,  45, 90, 100,
    MOVE G6B,130,  50,  60
    MOVE G6C,130,  50,  60
    WAIT

    SPEED 6
    MOVE G6A,100, 145,  45, 130, 100,
    MOVE G6D,100, 145,  45, 130, 100,
    WAIT


    SPEED 8
    GOSUB All_motor_mode2
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1

    '******************************
    DELAY 200
    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½ON
    RETURN

    '******************************************
    '******************************************
    '******************************************
    '**************************************************

    '******************************************
    '******************************************	
    '**********************************************

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,70
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½45ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,55
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,40
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½90ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,10
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,130
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,145
    GOTO MAIN	

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,160
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½90ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,190
    GOTO MAIN

ï¿½Ó¸ï¿½ï¿½Â¿ï¿½ï¿½ß¾ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,100
    GOTO MAIN

<<<<<<< HEAD
<<<<<<< HEAD
¸Ó¸®»óÇÏÁ¤¸é:
    SPEED ¸Ó¸®ÀÌµ¿¼Óµµ
<<<<<<< HEAD
<<<<<<< HEAD
    SERVO 11,100	' ÀÌ°Å ¸ÓÀÓ? ¿Ö »óÇÏÀÎµ¥ 11ÀÌ¾ß
=======
    SERVO 11,100	
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    SERVO 11,100	' ÀÌ°Å ¸ÓÀÓ? ¿Ö »óÇÏÀÎµ¥ 11ÀÌ¾ß
>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
=======
ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,100	
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    SPEED ï¿½Ó¸ï¿½ï¿½Ìµï¿½ï¿½Óµï¿½
    SERVO 11,100	
=======
¸Ó¸®»óÇÏÁ¤¸é:
    SPEED ¸Ó¸®ÀÌµ¿¼Óµµ
    SERVO 11,100	' ÀÌ°Å ¸ÓÀÓ? ¿Ö »óÇÏÀÎµ¥ 11ÀÌ¾ß
>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
>>>>>>> 12590a0 (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
    SPEED 5
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    GOTO MAIN

    '******************************************

ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    FOR i = 0 TO COUNT_MAX
        A = AD(ï¿½ÕµÚ±ï¿½ï¿½ï¿½ADï¿½ï¿½Æ®)	'ï¿½ï¿½ï¿½ï¿½ ï¿½Õµï¿½
        IF A > 250 OR A < 5 THEN RETURN
        IF A > MIN AND A < MAX THEN RETURN
        DELAY ï¿½ï¿½ï¿½ï¿½È®ï¿½Î½Ã°ï¿½
    NEXT i

    IF A < MIN THEN
        GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½
    ELSEIF A > MAX THEN
        GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½
    ENDIF

    RETURN
    '**************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½:
    A = AD(ï¿½ÕµÚ±ï¿½ï¿½ï¿½ADï¿½ï¿½Æ®)
    'IF A < MIN THEN GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ï¾î³ªï¿½ï¿½
    IF A < MIN THEN
        ETX  4800,16
        GOSUB ï¿½Ú·ï¿½ï¿½Ï¾î³ªï¿½ï¿½

    ENDIF
    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½:
    A = AD(ï¿½ÕµÚ±ï¿½ï¿½ï¿½ADï¿½ï¿½Æ®)
    'IF A > MAX THEN GOSUB ï¿½Ú·ï¿½ï¿½Ï¾î³ªï¿½ï¿½
    IF A > MAX THEN
        ETX  4800,15
        GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ï¾î³ªï¿½ï¿½
    ENDIF
    RETURN
    '**************************************************
ï¿½Â¿ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    FOR i = 0 TO COUNT_MAX
        B = AD(ï¿½Â¿ï¿½ï¿½ï¿½ï¿½ADï¿½ï¿½Æ®)	'ï¿½ï¿½ï¿½ï¿½ ï¿½Â¿ï¿½
        IF B > 250 OR B < 5 THEN RETURN
        IF B > MIN AND B < MAX THEN RETURN
        DELAY ï¿½ï¿½ï¿½ï¿½È®ï¿½Î½Ã°ï¿½
    NEXT i

    IF B < MIN OR B > MAX THEN
        SPEED 8
        MOVE G6B,140,  40,  80
        MOVE G6C,140,  40,  80
        WAIT
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½	
    ENDIF
    RETURN
    '******************************************
    '************************************************
SOUND_PLAY_CHK:
    DELAY 60
    SOUND_BUSY = IN(46)
    IF SOUND_BUSY = 1 THEN GOTO SOUND_PLAY_CHK
    DELAY 50

    RETURN
    '************************************************

    '************************************************
NUM_1_9:
    IF NUM = 1 THEN
        PRINT "1"
    ELSEIF NUM = 2 THEN
        PRINT "2"
    ELSEIF NUM = 3 THEN
        PRINT "3"
    ELSEIF NUM = 4 THEN
        PRINT "4"
    ELSEIF NUM = 5 THEN
        PRINT "5"
    ELSEIF NUM = 6 THEN
        PRINT "6"
    ELSEIF NUM = 7 THEN
        PRINT "7"
    ELSEIF NUM = 8 THEN
        PRINT "8"
    ELSEIF NUM = 9 THEN
        PRINT "9"
    ELSEIF NUM = 0 THEN
        PRINT "0"
    ENDIF

    RETURN
    '************************************************
    '************************************************
NUM_TO_ARR:

    NO_4 =  BUTTON_NO / 10000
    TEMP_INTEGER = BUTTON_NO MOD 10000

    NO_3 =  TEMP_INTEGER / 1000
    TEMP_INTEGER = BUTTON_NO MOD 1000

    NO_2 =  TEMP_INTEGER / 100
    TEMP_INTEGER = BUTTON_NO MOD 100

    NO_1 =  TEMP_INTEGER / 10
    TEMP_INTEGER = BUTTON_NO MOD 10

    NO_0 =  TEMP_INTEGER

    RETURN
    '************************************************
Number_Play: '  BUTTON_NO = ï¿½ï¿½ï¿½Ú´ï¿½ï¿½ï¿½


    GOSUB NUM_TO_ARR

    PRINT "NPL "
    '*************

    NUM = NO_4
    GOSUB NUM_1_9

    '*************
    NUM = NO_3
    GOSUB NUM_1_9

    '*************
    NUM = NO_2
    GOSUB NUM_1_9
    '*************
    NUM = NO_1
    GOSUB NUM_1_9
    '*************
    NUM = NO_0
    GOSUB NUM_1_9
    PRINT " !"

    'GOSUB SOUND_PLAY_CHK
    PRINT "SND 16 !"
    'GOSUB SOUND_PLAY_CHK
    RETURN
    '************************************************

    RETURN


    '******************************************

    ' ************************************************
ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ï¿½ï¿½È®ï¿½ï¿½:

    ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ = AD(ï¿½ï¿½ï¿½Ü¼ï¿½ADï¿½ï¿½Æ®)

    IF ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ > 50 THEN '50 = ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ = 25cm
        'MUSIC "C"
        DELAY 200
    ENDIF




    RETURN

    '******************************************


    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10:

    SPEED 5
    MOVE G6A,97,  86, 145,  75, 103, 100
    MOVE G6D,97,  66, 145,  95, 103, 100
    WAIT

    SPEED 12
    MOVE G6A,94,  86, 145,  75, 101, 100
    MOVE G6D,94,  66, 145,  95, 101, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  85, 98, 100
    MOVE G6D,101,  76, 146,  85, 98, 100
    WAIT

    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10:

    SPEED 5
    MOVE G6A,97,  66, 145,  95, 103, 100
    MOVE G6D,97,  86, 145,  75, 103, 100
    WAIT

    SPEED 12
    MOVE G6A,94,  66, 145,  95, 101, 100
    MOVE G6D,94,  86, 145,  75, 101, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  85, 98, 100
    MOVE G6D,101,  76, 146,  85, 98, 100
    WAIT

    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT
    GOTO RX_EXIT
    '**********************************************
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:

    GOSUB Leg_motor_mode2
    SPEED 8
    MOVE G6A,95,  96, 145,  65, 105, 100
    MOVE G6D,95,  56, 145,  105, 105, 100
    WAIT

    SPEED 12
    MOVE G6A,93,  96, 145,  65, 105, 100
    MOVE G6D,93,  56, 145,  105, 105, 100
    WAIT
    SPEED 6
    MOVE G6A,101,  76, 146,  85, 98, 100
    MOVE G6D,101,  76, 146,  85, 98, 100
    WAIT

    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT
    GOSUB Leg_motor_mode1
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20:

    GOSUB Leg_motor_mode2
    SPEED 8
    MOVE G6A,95,  56, 145,  105, 105, 100
    MOVE G6D,95,  96, 145,  65, 105, 100
    WAIT

    SPEED 12
    MOVE G6A,93,  56, 145,  105, 105, 100
    MOVE G6D,93,  96, 145,  65, 105, 100
    WAIT

    SPEED 6
    MOVE G6A,101,  76, 146,  85, 98, 100
    MOVE G6D,101,  76, 146,  85, 98, 100
    WAIT

    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT

    GOSUB Leg_motor_mode1
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:

    GOSUB Leg_motor_mode2
    SPEED 8
    MOVE G6A,95,  106, 145,  59, 105, 100
    MOVE G6D,95,  46, 145,  119, 105, 100
    WAIT

    SPEED 10
    MOVE G6A,93,  106, 145,  59, 105, 100
    MOVE G6D,93,  46, 145,  119, 105, 100
    WAIT

    SPEED 8
    MOVE G6A,100,  76, 145,  89, 100
    MOVE G6D,100,  76, 145,  89, 100
    WAIT
    GOSUB Leg_motor_mode1
    GOTO RX_EXIT

    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45:

    GOSUB Leg_motor_mode2
    SPEED 8
    MOVE G6A,95,  46, 145,  119, 105, 100
    MOVE G6D,95,  106, 145,  59, 105, 100
    WAIT

    SPEED 10
    MOVE G6A,93,  46, 145,  119, 105, 100
    MOVE G6D,93,  106, 145,  59, 105, 100
    WAIT

    SPEED 8
    MOVE G6A,100,  76, 145,  89, 100
    MOVE G6D,100,  76, 145,  89, 100
    WAIT
    GOSUB Leg_motor_mode1
    GOTO RX_EXIT
    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60:

    SPEED 15
    MOVE G6A,95,  116, 145,  45, 105, 100
    MOVE G6D,95,  36, 145,  125, 105, 100
    WAIT

    SPEED 15
    MOVE G6A,90,  116, 145,  45, 105, 100
    MOVE G6D,90,  36, 145,  125, 105, 100
    WAIT

    SPEED 10
    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT
    GOTO RX_EXIT

    '**********************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60:

    SPEED 15
    MOVE G6A,95,  36, 145,  125, 105, 100
    MOVE G6D,95,  116, 145,  45, 105, 100
    WAIT

    SPEED 15
    MOVE G6A,90,  36, 145,  125, 105, 100
    MOVE G6D,90,  116, 145,  45, 105, 100
    WAIT

    SPEED 10
    MOVE G6A,100,  76, 145,  85, 100
    MOVE G6D,100,  76, 145,  85, 100
    WAIT
    GOTO RX_EXIT

    '************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:
    MOVE G6B, 143, 10, 60,	  ,	  ,
    MOVE G6C, 143, 10, 60,	  ,   ,
    WAIT
    DELAY 3
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 12
        MOVE G6A,102,  73, 145,  93, 100, 100
        MOVE G6D,102,  79, 145,  93, 100, 100
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6A,102,  84, 145,  78, 100, 100
        MOVE G6D,102,  68, 145,  108, 100, 100
        MOVE G6A,100,  84, 145,  78, 100, 100
        MOVE G6D,100,  68, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  90, 145,  78, 102, 100
        MOVE G6D,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 6
        MOVE G6A,90,  80, 130, 102, 104
        MOVE G6D,105,  76, 146,  93,  100
        WAIT
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 12
        MOVE G6A,102,  73, 145,  93, 100, 100
        MOVE G6D,102,  79, 145,  93, 100, 100
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6A,102,  88, 145,  78, 100, 100
        MOVE G6D,102,  65, 145,  108, 100, 100
        MOVE G6A,100,  88, 145,  78, 100, 100
        MOVE G6D,100,  65, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,104,  86, 146,  80, 100, 100
        MOVE G6D,90,  58, 145,  110, 100, 100
        WAIT
        SPEED 6
        MOVE G6D,90,  85, 130, 98, 104
        MOVE G6A,105,  77, 146,  93,  100
        WAIT
    ENDIF
    SPEED 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT
    GOTO RX_EXIT
    '*************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3_LOOP:
    MOVE G6B, 143, 10, 60,	  ,	  ,
    MOVE G6C, 143, 10, 60,	  ,   ,
    WAIT
    DELAY 3

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 12
        MOVE G6D,102,  73, 145,  93, 100, 100
        MOVE G6A,102,  79, 145,  93, 100, 100
        WAIT

        SPEED 5
        MOVE G6D,102,  84, 145,  78, 100, 100
        MOVE G6A,102,  68, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,90,  90, 145,  78, 102, 100
        MOVE G6A,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 6
        MOVE G6D,90,  80, 130, 102, 104
        MOVE G6A,105,  76, 146,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 12
        MOVE G6D,102,  73, 145,  93, 100, 100
        MOVE G6A,102,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6D,102,  88, 145,  78, 100, 100
        MOVE G6A,102,  65, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,104,  86, 146,  80, 100, 100
        MOVE G6A,90,  58, 145,  110, 100, 100
        WAIT

        SPEED 6
        MOVE G6A,90,  85, 130, 98, 104
        MOVE G6D,105,  77, 146,  93,  100
        WAIT



    ENDIF

    SPEED 10
    '    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT

    GOTO RX_EXIT


    '************************************************
    '************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 4 !"
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    RETURN

È®ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 5 !"
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    RETURN

ï¿½ï¿½ï¿½ï¿½:
    SPEED 10
    MOVE G6C, 190, 30, 80
    WAIT
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 0 !"
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    DELAY 500
    PRINT "SOUND 0 !"
    DELAY 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN

ï¿½ï¿½ï¿½ï¿½:
    SPEED 10
    MOVE G6B, 190, 30, 80
    WAIT
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 1 !"
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    DELAY 500
    PRINT "SOUND 1 !"
    DELAY 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2	
    RETURN
ï¿½ï¿½ï¿½ï¿½:
    SPEED 10
    MOVE G6B, 30, 30, 80
    MOVE G6C, 30, 30, 80
    WAIT
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 2 !"
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    DELAY 500
    PRINT "SOUND 2 !"
    DELAY 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN
ï¿½ï¿½ï¿½ï¿½:
    SPEED 10
    MOVE G6B, 190, 30, 80
    MOVE G6C, 190, 30, 80
    WAIT
    PRINT "OPEN 20GongMo.mrs !"
    PRINT "SOUND 3 !"
    DELAY 500
    PRINT "SOUND 3 !"
    DELAY 10
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB SOUND_PLAY_CHK
=======
    'GOSUB SOUND_PLAY_CHK
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    GOSUB SOUND_PLAY_CHK
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    GOSUB ±âº»ÀÚ¼¼2
=======
    'GOSUB SOUND_PLAY_CHK
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    'GOSUB SOUND_PLAY_CHK
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
=======
    GOSUB SOUND_PLAY_CHK
    GOSUB ±âº»ÀÚ¼¼2
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
    RETURN
    '******************************************

Aï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN M_ABCD.mrs !"
    PRINT "SOUND 0 !"
    RETURN
Bï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN M_ABCD.mrs !"
    PRINT "SOUND 1 !"
    RETURN
Cï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN M_ABCD.mrs !"
    PRINT "SOUND 2 !"
    RETURN
Dï¿½ï¿½ï¿½ï¿½:
    PRINT "OPEN M_ABCD.mrs !"
    PRINT "SOUND 3 !"
    RETURN

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ110µµ:
    SPEED 3
    SERVO 16, 110

    RETURN
    '******************************************
Àü¹æÇÏÇâ105µµ:
    SPEED 3
    SERVO 16, 105

    RETURN
    '******************************************
<<<<<<< HEAD
=======
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ100µµ:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½100ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½100ï¿½ï¿½:
=======
Àü¹æÇÏÇâ110µµ:
    SPEED 3
    SERVO 16, 110

    RETURN
    '******************************************
Àü¹æÇÏÇâ105µµ:
    SPEED 3
    SERVO 16, 105

    RETURN
    '******************************************
Àü¹æÇÏÇâ100µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    SPEED 3
    SERVO 16, 100

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½97ï¿½ï¿½:
    SPEED 3
    SERVO 16, 97

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½95ï¿½ï¿½:
    SPEED 3
    SERVO 16, 95

    RETURN
    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ90µµ:
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½90ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½90ï¿½ï¿½:
=======
Àü¹æÇÏÇâ90µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    SPEED 3
    SERVO 16, 92

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½85ï¿½ï¿½:

    SPEED 3
    SERVO 16, 85

    RETURN
    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
Àü¹æÇÏÇâ80µµ:
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½80ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½80ï¿½ï¿½:
=======
Àü¹æÇÏÇâ80µµ:
>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
>>>>>>> 12590a0 (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)

    SPEED 3
    SERVO 16, 80

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½75ï¿½ï¿½:
    SPEED 3
    SERVO 16, 76

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½:
    SPEED 3
    SERVO 16, 73

    RETURN
    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ65µµ:
    SPEED 3
    SERVO 16, 69

    RETURN
    '******************************************
<<<<<<< HEAD
=======
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ60µµ:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½:
=======
Àü¹æÇÏÇâ65µµ:
    SPEED 3
    SERVO 16, 69

    RETURN
    '******************************************
Àü¹æÇÏÇâ60µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    SPEED 3
    SERVO 16, 65

    RETURN

    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
Àü¹æÇÏÇâ55µµ:

    SPEED 3
    SERVO 16, 59
=======
Àü¹æÇÏÇâ54µµ:

    SPEED 3
    SERVO 16, 58
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
Àü¹æÇÏÇâ55µµ:

    SPEED 3
    SERVO 16, 59
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½54ï¿½ï¿½:
=======
Àü¹æÇÏÇâ55µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    SPEED 3
<<<<<<< HEAD
    SERVO 16, 58
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    SERVO 16, 59
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    RETURN

    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
Àü¹æÇÏÇâ50µµ:
=======

Àü¹æÇÏÇâ50µµ:

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
Àü¹æÇÏÇâ50µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½50ï¿½ï¿½:

>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½50ï¿½ï¿½:

=======
Àü¹æÇÏÇâ50µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    SPEED 3
    SERVO 16, 54

    RETURN
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======

>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    '******************************************

<<<<<<< HEAD
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45ï¿½ï¿½:

=======
Àü¹æÇÏÇâ45µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    SPEED 3
    SERVO 16, 50
    
    RETURN
    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
Àü¹æÇÏÇâ35µµ:
=======

=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    '******************************************

Àü¹æÇÏÇâ45µµ:
    SPEED 3
    SERVO 16, 50
    
    RETURN
    '******************************************
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ40µµ:
    SPEED 3
    SERVO 16, 45

    RETURN
    '******************************************
<<<<<<< HEAD
Àü¹æÇÏÇâ35µµ:
<<<<<<< HEAD

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½35ï¿½ï¿½:

>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
<<<<<<< HEAD
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½35ï¿½ï¿½:

=======
Àü¹æÇÏÇâ35µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    SPEED 3
    SERVO 16, 40
    RETURN

    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ30µµ:
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½:
=======
Àü¹æÇÏÇâ30µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    SPEED 3
    SERVO 16, 36

    RETURN
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    '******************************************
Àü¹æÇÏÇâ25µµ:
    SPEED 3
    SERVO 16, 30
<<<<<<< HEAD
=======
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    RETURN
    '******************************************
Àü¹æÇÏÇâ20µµ:
    SPEED 3
    SERVO 16, 26

    RETURN
    '******************************************
<<<<<<< HEAD
Àü¹æÇÏÇâ20µµ:
    SPEED 3
    SERVO 16, 26

    RETURN
<<<<<<< HEAD
=======

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    '******************************************
Àü¹æÇÏÇâ18µµ:

    SPEED 3
    SERVO 16, 22
<<<<<<< HEAD
<<<<<<< HEAD
    
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½:

    SPEED 3
    SERVO 16, 22
<<<<<<< HEAD
    '  ETX 4800,40
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    RETURN
    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
=======
    '  ETX 4800,40
=======
    
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    RETURN
    '******************************************
<<<<<<< HEAD

>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
Àü¹æÇÏÇâ10µµ:

    SPEED 3
    SERVO 16, 10
<<<<<<< HEAD
<<<<<<< HEAD

    RETURN
    '******************************************
=======
    '   ETX 4800,41
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

=======
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10ï¿½ï¿½:
=======
Àü¹æÇÏÇâ10µµ:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

    SPEED 3
    SERVO 16, 10
<<<<<<< HEAD
    '   ETX 4800,41
<<<<<<< HEAD
    
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)

>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    RETURN
    '******************************************

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
Àü¹æÇÏÇâ110µµ:
=======
=======
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½110ï¿½ï¿½:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)

    SPEED 3
    SERVO 16, 110
    '   ETX 4800,41
<<<<<<< HEAD
<<<<<<< HEAD

    RETURN
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)

=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
¾çÆÈ¹ú¸®±â:
=======
    
=======

>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    RETURN

ï¿½ï¿½ï¿½È¹ï¿½ï¿½ï¿½ï¿½ï¿½:
<<<<<<< HEAD
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
=======
¾çÆÈ¹ú¸®±â:
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    'MOVE G6A, 101,  83, 128,  96,  99, 100
    'MOVE G6D, 100,  79, 128, 100,  99, 100
    MOVE G6B, 107, 101, 100, 100, 100, 101
    MOVE G6C, 107, 101, 100, 100, 100, 100
    WAIT


    RETURN

ï¿½ï¿½ï¿½âº»ï¿½Ú¼ï¿½:
    MOVE G6B, 90, 80, 80, 90, 100, 101
    MOVE G6C, 90, 80, 80, 90, 100, 100
    WAIT

    RETURN


ï¿½ï¿½ï¿½È¾ï¿½ï¿½ï¿½ï¿½ï¿½:
    SPEED 4
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN

ï¿½ï¿½ï¿½È¾ï¿½ï¿½ï¿½ï¿½Î¿ï¿½ï¿½Ê°È±ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6A, 95,  90, 125, 100, 104, 100
    MOVE G6D,105,  76, 145,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6A, 102,  77, 145, 93, 100, 100
    MOVE G6D,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6A,95,  76, 145,  93, 102, 100
    MOVE G6D,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100


    GOSUB All_motor_mode3
    GOTO RX_EXIT


    '******************************************	
ï¿½ï¿½ï¿½È¾ï¿½ï¿½ï¿½ï¿½Î¿ï¿½ï¿½ï¿½ï¿½Ê°È±ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6D, 95,  90, 125, 100, 104, 100
    MOVE G6A,105,  76, 146,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6D, 102,  77, 145, 93, 100, 100
    MOVE G6A,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6D,95,  76, 145,  93, 102, 100
    MOVE G6A,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOSUB All_motor_mode3
    GOTO RX_EXIT




ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½OFF
    SPEED 8  'before 2
    MOVE G6A, 100, 150, 30,   150, 100,	
    MOVE G6D, 100, 150, 30,   150, 100,
    MOVE G6B, 140, 30, 80,	  ,	  ,
    MOVE G6C, 140, 30, 80,	  ,   ,
    WAIT

    DELAY 50
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    ETX 4800, 46
    SPEED 4  'before 4
    'DELAY 20
    MOVE G6A, 100, 150, 30,   150, 100,	
    MOVE G6D, 100, 150, 30,   150, 100,
    MOVE G6B, 150, 10, 60,	  ,	  ,
    MOVE G6C, 150, 10, 60,	  ,   ,
    WAIT

    DELAY 20
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    ETX 4800, 46
    SPEED 8   'before 4
    MOVE G6A,100, 76,  145,    93,  100, 100
    MOVE G6D,100, 76,  145,    93,  100, 100
    MOVE G6B, 150, 10, 60,	  ,	  ,
    MOVE G6C, 150, 10, 60,	  ,   ,
    WAIT

    'DELAY 20
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    ETX 4800, 46
    SPEED 8  'before 4
    MOVE G6A,100, 76,  145,    93,  100, 100
    MOVE G6D,100, 76,  145,    93,  100, 100
    MOVE G6B, 160
    MOVE G6C, 160
    WAIT

    RETURN
    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    MOVE G6B, 175, 10, 60,	  ,	  ,
    MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6A, 95,  90, 125, 100, 104, 100
    MOVE G6D,105,  76, 145,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6A, 102,  77, 145, 93, 100, 100
    MOVE G6D,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6A,95,  76, 145,  93, 102, 100
    MOVE G6D,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100


    GOSUB All_motor_mode3
    GOTO RX_EXIT


    '******************************************	
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    MOVE G6B, 175, 10, 60,	  ,	  ,
    MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6D, 95,  90, 125, 100, 104, 100
    MOVE G6A,105,  76, 146,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6D, 102,  77, 145, 93, 100, 100
    MOVE G6A,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6D,95,  76, 145,  93, 102, 100
    MOVE G6A,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOSUB All_motor_mode3
    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½2:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½2_LOOP:
    DELAY  10

    SPEED 10
    MOVE G6D, 90,  90, 120, 105, 110, 100
    MOVE G6A,100,  76, 145,  93, 107, 100
    MOVE G6B, 175, 10, 60,	  ,	  ,
    MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    SPEED 13
    MOVE G6D, 102,  76, 145, 93, 100, 100
    MOVE G6A,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6D,98,  76, 145,  93, 100, 100
    MOVE G6A,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT


    '  ERX 4800, A ,ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    '    IF A = A_OLD THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    'ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_stop:
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT
    '**********************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½2:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½2_LOOP:
    DELAY  10

    SPEED 10
    MOVE G6A, 90,  90, 120, 105, 110, 100	
    MOVE G6D,100,  76, 145,  93, 107, 100	
    MOVE G6B, 175, 10, 60,	  ,	  ,
    MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    SPEED 13
    MOVE G6A, 102,  76, 145, 93, 100, 100
    MOVE G6D,83,  78, 140,  96, 115, 100
    WAIT

    SPEED 13
    MOVE G6A,98,  76, 145,  93, 100, 100
    MOVE G6D,98,  76, 145,  93, 100, 100
    WAIT

    SPEED 12
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6A,100,  76, 145,  93, 100, 100
    WAIT

    '   ERX 4800, A ,ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop	
    '    IF A = A_OLD THEN  GOTO ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_loop
    'ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½ï¿½ï¿½_stop:

    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOTO RX_EXIT

    '******************************************

    '******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    '   MOVE G6B, 175, 10, 60,	  ,	  ,
    '  MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6A, 95,  90, 125, 100, 104, 100
    MOVE G6D,105,  76, 145,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6A, 102,  77, 145, 93, 100, 100
    MOVE G6D,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6A,95,  76, 145,  93, 102, 100
    MOVE G6D,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100


    GOSUB All_motor_mode3
    GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2
    '   MOVE G6B, 175, 10, 60,	  ,	  ,
    '  MOVE G6C, 175, 10, 60,	  ,   ,
    '   MOVE G6B, 175, 10, 60,	  ,	  ,
    '  MOVE G6C, 175, 10, 60,	  ,   ,
    WAIT

    DELAY 3

    SPEED 12
    MOVE G6D, 95,  90, 125, 100, 104, 100
    MOVE G6A,105,  76, 146,  93, 104, 100
    WAIT

    SPEED 12
    MOVE G6D, 102,  77, 145, 93, 100, 100
    MOVE G6A,90,  80, 140,  95, 107, 100
    WAIT

    SPEED 10
    MOVE G6D,95,  76, 145,  93, 102, 100
    MOVE G6A,95,  76, 145,  93, 102, 100
    WAIT

    SPEED 8
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100

    GOSUB All_motor_mode3
    GOTO RX_EXIT


ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    GOSUB ï¿½ï¿½ï¿½Ì·ï¿½OFF
    MOVE G6B, 145, , ,
    MOVE G6C, 145, , ,
    WAIT

    MOVE G6B, 140, 10, 60,	  ,	  ,
    MOVE G6C, 140, 10, 60,	  ,   ,
    WAIT

    GOTO ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_2	
ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_2:
    ETX 4800, 47
    MOVE G6A, 100, 150, 30,   150, 100,	
    MOVE G6D, 100, 150, 30,   150, 100,
    MOVE G6B, 150, , ,
    MOVE G6C, 150, , ,
    WAIT

    GOTO ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_3
ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_3:
    ETX 4800, 47
    MOVE G6B, , 30, 90
    MOVE G6C, , 30, 90
    WAIT

    GOTO ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_4
ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½_4:
    ETX 4800, 47
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT

    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    'HIGHSPEED SETON
    MOVE G6B, 160, 10, 50
    MOVE G6C, 160, 10, 50


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        'MOVE G6B,100
        'MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        'MOVE G6B,100
        'MOVE G6C,100
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF


    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    MOVE G6A,95,  90, 125, 100, 104
    MOVE G6D,104,  77, 147,  93,  102
    'MOVE G6B, 85
    'MOVE G6C,115
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:

    MOVE G6A,103,   73, 140, 103,  100
    MOVE G6D, 95,  85, 147,  85, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

        GOTO RX_EXIT
    ENDIF

    ' ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    'IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2_stop:
        MOVE G6D,95,  90, 125, 95, 104
        MOVE G6A,104,  76, 145,  91,  102
        'MOVE G6C, 100
        'MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6D,95,  95, 120, 100, 104
    MOVE G6A,104,  77, 147,  93,  102
    'MOVE G6C, 85
    'MOVE G6B,115
    WAIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5:
    MOVE G6D,103,    73, 140, 103,  100
    MOVE G6A, 95,  85, 147,  85, 102
    WAIT


    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ' ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    ' IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_5_stop:
        MOVE G6A,95,  90, 125, 95, 104
        MOVE G6D,104,  76, 145,  91,  102
        'MOVE G6B, 100
        'MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 5
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 6
    GOSUB All_motor_mode3
    MOVE G6B, 160, 10, 50
    MOVE G6C, 160, 10, 50
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 6
    MOVE G6D,  90,  74, 144,  95, 110
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 8
    MOVE G6D,90, 90, 120, 102, 110,100
    MOVE G6A,108,  76, 147,  93,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 102, 107,100
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 115, 110
    MOVE G6A,108,  76, 147,  90,  96
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 90,  98
    MOVE G6A,90, 100, 142,  69, 108
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    SPEED 9
    MOVE G6A,95, 90, 120, 102, 111,100
    MOVE G6D,108,  76, 146,  93,  96,100
    WAIT

    SPEED 7
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT

    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 10
    GOSUB All_motor_mode3
    MOVE G6B,185,  10,  60
    MOVE G6C,185,  10,  60
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 10
    MOVE G6D,  90,  74, 142,  94, 109
    MOVE G6A, 108,  76, 144,  93, 96
    WAIT

    SPEED 12
    MOVE G6D,90, 90, 118, 101, 109,99
    MOVE G6A,108,  76, 145,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    MOVE G6A,110,  76, 145,  93, 100,100
    MOVE G6D,96, 90, 118, 101, 106,99
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 143, 114, 109
    MOVE G6A,108,  76, 145,  89,  95
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 145, 89,  97
    MOVE G6A,90, 100, 140,  68, 107
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    SPEED 13
    MOVE G6A,95, 90, 118, 101, 110,99
    MOVE G6D,108,  76, 144,  92,  95,99
    WAIT

    SPEED 11
    MOVE G6A,100,  76, 143,  92, 99, 100
    MOVE G6D,100,  76, 143,  92, 99, 100
    WAIT

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    GOTO RX_EXIT
    '*******************
=======
    RETURN
=======
    GOTO RX_EXIT
>>>>>>> 93c16a2 (Chore: ì§‘ê³ ì „ì§„ ì˜¤ë¥˜ ìˆ˜ì •)
    '*******************
<<<<<<< HEAD
¹®¿­°íÁý°íÀüÁø:
    º¸Çà¼Óµµ = 8
    ÁÂ¿ì¼Óµµ = 4
    ³Ñ¾îÁøÈ®ÀÎ = 0

    'GOSUB Àü¹æÇÏÇâ18µµ
    'DELAY 20
    SPEED 6
    GOSUB All_motor_mode3
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 10
    MOVE G6D,  90,  74, 144,  94, 109
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 12
    MOVE G6D,90, 90, 120, 101, 109,99
    MOVE G6A,108,  76, 147,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ¹®¿­°íÁý°íÀüÁø_2	

¹®¿­°íÁý°íÀüÁø_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 101, 106,99
    WAIT

¹®¿­°íÁý°íÀüÁø_3:
    'ETX 4800,13 'ÁøÇàÄÚµå¸¦ º¸³¿

    SPEED º¸Çà¼Óµµ

    MOVE G6D, 90,  56, 145, 114, 109
    MOVE G6A,108,  76, 147,  89,  95
    WAIT

    SPEED ÁÂ¿ì¼Óµµ
    MOVE G6D,108,  76, 147, 89,  97
    MOVE G6A,90, 100, 142,  68, 107
    WAIT

    SPEED º¸Çà¼Óµµ

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ¹®¿­°íÁý°íÀüÁø_4
    IF A = 11 THEN
        GOTO ¹®¿­°íÁý°íÀüÁø_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ±âº»ÀÚ¼¼2

        ' 		GOTO RX_EXIT
    ENDIF
¹®¿­°íÁý°íÀüÁø_4:
    SPEED 13
    MOVE G6A,95, 90, 120, 101, 110,99
    MOVE G6D,108,  76, 146,  92,  95,99
    WAIT

    SPEED 11
    MOVE G6A,100,  76, 145,  92, 99, 100
    MOVE G6D,100,  76, 145,  92, 99, 100
    WAIT

    RETURN
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 090d4a9 (Chore: ë¬¸ì—´ê³  ë‹¬ë¦¬ê¸° ëª¨ì…˜ ì‚­ì œ)
È½¼ö_Áý°íÈÄÁø:
=======
    RETURN
    '*******************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 6
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    GOSUB All_motor_mode3
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 10
    MOVE G6D,  90,  74, 144,  94, 109
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 12
    MOVE G6D,90, 90, 120, 101, 109,99
    MOVE G6A,108,  76, 147,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 101, 106,99
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 114, 109
    MOVE G6A,108,  76, 147,  89,  95
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 89,  97
    MOVE G6A,90, 100, 142,  68, 107
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    SPEED 13
    MOVE G6A,95, 90, 120, 101, 110,99
    MOVE G6D,108,  76, 146,  92,  95,99
    WAIT

    SPEED 11
    MOVE G6A,100,  76, 145,  92, 99, 100
    MOVE G6D,100,  76, 145,  92, 99, 100
    WAIT

    RETURN
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½:
    GOSUB All_motor_mode3
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    SPEED 7
    'HIGHSPEED SETON


    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  76, 145,  93, 98
        MOVE G6B, 190, 10, 50
        MOVE G6C, 190, 10, 50
        WAIT

        GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 145,  93, 101
        MOVE G6A,101,  76, 145,  93, 98
        MOVE G6B, 190, 10, 50
        MOVE G6C, 190, 10, 50
        WAIT

        GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    ENDIF

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    '*******************************************

=======

    '**********************
¹®¿­°íÀüÁø´Þ¸®±â50:
    ³Ñ¾îÁøÈ®ÀÎ = 0
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
=======

    '**********************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50:
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
    DELAY 50
    SPEED 6
    HIGHSPEED SETON

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  77, 146,  93, 98
        WAIT

        MOVE G6A,95,  80, 120, 120, 104
        MOVE G6D,104,  77, 147,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        MOVE G6D,95,  76, 146,  93, 101
        MOVE G6A,101,  77, 145,  93, 98
        WAIT

        MOVE G6D,95,  80, 121, 120, 104
        MOVE G6A,104,  77, 146,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT

        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5
    ENDIF
    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1:
    MOVE G6A,95,  95, 100, 120, 104
    MOVE G6D,104,  77, 148,  93,  102
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2:
    MOVE G6A,95,  75, 122, 120, 104
    MOVE G6D,104,  78, 148,  90,  100
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3:
    MOVE G6A,103,  69, 145, 103,  100
    MOVE G6D, 95, 87, 161,  68, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop:

        MOVE G6D,90,  93, 116, 100, 104
        MOVE G6A,104,  74, 145,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        ' GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 13
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100

        DELAY 150
        GOTO RX_EXIT
    ENDIF
    '*********************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4:
    MOVE G6D,95,  95, 101, 120, 104
    MOVE G6A,104,  77, 147,  93,  102
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5:
    MOVE G6D,95,  75, 123, 120, 104
    MOVE G6A,104,  78, 147,  90,  100
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6:
    MOVE G6D,103,  69, 146, 103,  100
    MOVE G6A, 95, 87, 160,  68, 102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop
    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop:

        MOVE G6A,90,  93, 115, 100, 104
        MOVE G6D,104,  74, 146,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        ' GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        SPEED 13
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100
        DELAY 150
        GOTO RX_EXIT
    ENDIF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1





    '*******************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50:
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
    GOSUB All_motor_mode3
    ï¿½ï¿½ï¿½ï¿½COUNT = 0
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    DELAY 50
    SPEED 6
    HIGHSPEED SETON

<<<<<<< HEAD
    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  77, 146,  93, 98
        WAIT

        MOVE G6A,95,  80, 120, 120, 104
        MOVE G6D,104,  77, 147,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT

        GOTO ¹®¿­°íÀüÁø´Þ¸®±â50_2
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 146,  93, 101
        MOVE G6A,101,  77, 145,  93, 98
        WAIT

        MOVE G6D,95,  80, 121, 120, 104
        MOVE G6A,104,  77, 146,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT

        GOTO ¹®¿­°íÀüÁø´Þ¸®±â50_5
    ENDIF
    '**********************

¹®¿­°íÀüÁø´Þ¸®±â50_1:
    MOVE G6A,95,  95, 100, 120, 104
    MOVE G6D,104,  77, 148,  93,  102
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT

¹®¿­°íÀüÁø´Þ¸®±â50_2:
    MOVE G6A,95,  75, 122, 120, 104
    MOVE G6D,104,  78, 148,  90,  100
    WAIT

¹®¿­°íÀüÁø´Þ¸®±â50_3:
    MOVE G6A,103,  69, 145, 103,  100
    MOVE G6D, 95, 87, 161,  68, 102
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­°íÀüÁø´Þ¸®±â50_3_stop

    ERX 4800,A, ¹®¿­°íÀüÁø´Þ¸®±â50_4
    IF A <> A_old THEN
¹®¿­°íÀüÁø´Þ¸®±â50_3_stop:

        MOVE G6D,90,  93, 116, 100, 104
        MOVE G6A,104,  74, 145,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        ' GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 13
        ' GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100

        DELAY 150
        GOTO RX_EXIT
    ENDIF
    '*********************************

¹®¿­°íÀüÁø´Þ¸®±â50_4:
    MOVE G6D,95,  95, 101, 120, 104
    MOVE G6A,104,  77, 147,  93,  102
    MOVE G6B, 185, 10, 80
    MOVE G6C, 190, 10, 80
    WAIT
¹®¿­°íÀüÁø´Þ¸®±â50_5:
    MOVE G6D,95,  75, 123, 120, 104
    MOVE G6A,104,  78, 147,  90,  100
    WAIT

¹®¿­°íÀüÁø´Þ¸®±â50_6:
    MOVE G6D,103,  69, 146, 103,  100
    MOVE G6A, 95, 87, 160,  68, 102
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF
    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ¹®¿­°íÀüÁø´Þ¸®±â50_6_stop
    ERX 4800,A, ¹®¿­°íÀüÁø´Þ¸®±â50_1
    IF A <> A_old THEN
¹®¿­°íÀüÁø´Þ¸®±â50_6_stop:

        MOVE G6A,90,  93, 115, 100, 104
        MOVE G6D,104,  74, 146,  91,  102
        MOVE G6B, 185, 10, 80
        MOVE G6C, 190, 10, 80
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        ' GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 13
        ' GOSUB ±âº»ÀÚ¼¼2
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100
        DELAY 150
        GOTO RX_EXIT
    ENDIF
    GOTO ¹®¿­°íÀüÁø´Þ¸®±â50_1





=======
>>>>>>> 090d4a9 (Chore: ë¬¸ì—´ê³  ë‹¬ë¦¬ê¸° ëª¨ì…˜ ì‚­ì œ)
    '*******************************************

<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50:
    ³Ñ¾îÁøÈ®ÀÎ = 0
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    DELAY 50
    SPEED 6
    HIGHSPEED SETON

    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
=======
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
        MOVE G6A,95,  76, 145,  93, 101
        MOVE G6D,101,  77, 146,  93, 98
        WAIT

        MOVE G6A,95,  80, 120, 120, 104
        MOVE G6D,104,  77, 147,  91,  102
        MOVE G6B,185,  10,  60
        MOVE G6C,185,  10,  60
        WAIT

<<<<<<< HEAD
        GOTO Áý°íÀüÁø´Þ¸®±â50_2
    ELSE
        º¸Çà¼ø¼­ = 0
=======
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
        MOVE G6D,95,  76, 146,  93, 101
        MOVE G6A,101,  77, 145,  93, 98
        WAIT

        MOVE G6D,95,  80, 121, 120, 104
        MOVE G6A,104,  77, 146,  91,  102
        MOVE G6B,185,  10,  60
        MOVE G6C,185,  10,  60
        WAIT

<<<<<<< HEAD
        GOTO Áý°íÀüÁø´Þ¸®±â50_5
    ENDIF
    '**********************

Áý°íÀüÁø´Þ¸®±â50_1:
=======
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5
    ENDIF
    '**********************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6A,95,  95, 100, 120, 104
    MOVE G6D,104,  77, 148,  93,  102
    MOVE G6B,185,  10,  60
    MOVE G6C,185,  10,  60
    WAIT

<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50_2:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_2:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6A,95,  75, 122, 120, 104
    MOVE G6D,104,  78, 148,  90,  100
    WAIT

<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50_3:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6A,103,  69, 145, 103,  100
    MOVE G6D, 95, 87, 161,  68, 102
    WAIT

<<<<<<< HEAD
    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO Áý°íÀüÁø´Þ¸®±â50_3_stop

    ERX 4800,A, ¹®¿­°íÀüÁø´Þ¸®±â50_4
    IF A <> A_old THEN
Áý°íÀüÁø´Þ¸®±â50_3_stop:
=======
    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop

    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_3_stop:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)

        MOVE G6D,90,  93, 116, 100, 104
        MOVE G6A,104,  74, 145,  91,  102
        MOVE G6B,185,  10,  60
        MOVE G6C,185,  10,  60
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
<<<<<<< HEAD
        ' GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        ' GOSUB ±âº»ÀÚ¼¼2
=======
        ' GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100

        DELAY 150
        GOTO RX_EXIT
    ENDIF
    '*********************************

<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50_4:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_4:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6D,95,  95, 101, 120, 104
    MOVE G6A,104,  77, 147,  93,  102
    MOVE G6B,185,  10,  60
    MOVE G6C,185,  10,  60
    WAIT
<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50_5:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_5:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6D,95,  75, 123, 120, 104
    MOVE G6A,104,  78, 147,  90,  100
    WAIT

<<<<<<< HEAD
Áý°íÀüÁø´Þ¸®±â50_6:
=======
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6D,103,  69, 146, 103,  100
    MOVE G6A, 95, 87, 160,  68, 102
    WAIT

<<<<<<< HEAD
    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF
    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO Áý°íÀüÁø´Þ¸®±â50_6_stop
    ERX 4800,A, Áý°íÀüÁø´Þ¸®±â50_1
    IF A <> A_old THEN
Áý°íÀüÁø´Þ¸®±â50_6_stop:
=======
    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop
    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1
    IF A <> A_old THEN
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_6_stop:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)

        MOVE G6A,90,  93, 115, 100, 104
        MOVE G6D,104,  74, 146,  91,  102
        MOVE G6B,185,  10,  60
        MOVE G6C,185,  10,  60
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
<<<<<<< HEAD
        ' GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        ' GOSUB ±âº»ÀÚ¼¼2
=======
        ' GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        ' GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
        MOVE G6A,100,  76, 145,  91, 100, 100
        MOVE G6D,100,  76, 145,  91, 100, 100
        DELAY 150
        GOTO RX_EXIT
    ENDIF
<<<<<<< HEAD
    GOTO Áý°íÀüÁø´Þ¸®±â50_1


>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> a915980 (Chore: ì§‘ê³ ì „ì§„ë‹¬ë‹¬ë¦¬ê¸° ëª¨ì…˜ ì‚­ì œ)
È½¼ö_Áý°íÈÄÁø_1:
=======
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½50_1


È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    MOVE G6D,104,  76, 147,  93,  102
    MOVE G6A,95,  95, 120, 95, 104
    MOVE G6B, 190, 10, 50
    MOVE G6C, 190, 10, 50
    WAIT



È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    MOVE G6A, 103,  79, 147,  89, 100
    MOVE G6D,95,   65, 147, 103,  102
    WAIT

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF
    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop
    ERX 4800,A, È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4
    IF A <> A_old THEN
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3_stop:
        MOVE G6D,95,  85, 130, 100, 104
        MOVE G6A,104,  77, 146,  93,  102
        MOVE G6B, 190, 10, 50
        MOVE G6C, 190, 10, 50
        WAIT

        'SPEED 15
        '        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        '   DELAY 400
        GOTO RX_EXIT
    ENDIF
    '*********************************

È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_4:
    MOVE G6A,104,  76, 147,  93,  102
    MOVE G6D,95,  95, 120, 95, 104
    MOVE G6B, 190, 10, 50
    MOVE G6C, 190, 10, 50
    WAIT


È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6:
    MOVE G6D, 103,  79, 147,  89, 100
    MOVE G6A,95,   65, 147, 103,  102
    WAIT
    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO RX_EXIT
    ENDIF

    ï¿½ï¿½ï¿½ï¿½COUNT = ï¿½ï¿½ï¿½ï¿½COUNT + 1
    IF ï¿½ï¿½ï¿½ï¿½COUNT > ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ THEN  GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop

    ERX 4800,A, È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1
    IF A <> A_old THEN  'GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½
È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_6_stop:
        MOVE G6A,95,  85, 130, 100, 104
        MOVE G6D,104,  77, 146,  93,  102
        MOVE G6B, 190, 10, 50
        MOVE G6C, 190, 10, 50
        WAIT

        'SPEED 15
        '        GOSUB ï¿½ï¿½ï¿½ï¿½È­ï¿½Ú¼ï¿½
        '       HIGHSPEED SETOFF
        '      SPEED 5
        '     GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        '  DELAY 400
        GOTO RX_EXIT
    ENDIF

    GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    SPEED 4
    MOVE G6B, 190, 20, 60
    MOVE G6C, 190, 20, 60
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    SPEED 4
    MOVE G6B, 150, 20, 60
    MOVE G6C, 150, 20, 60
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_1:
    SPEED 4
    MOVE G6B, 190, 10, 50
    MOVE G6C, 190, 10, 50
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN
    'GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_2:
    SPEED 4
    MOVE G6B, 150, 10, 50
    MOVE G6C, 150, 10, 50
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN
    ' GOTO RX_EXIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½_3:
    SPEED 4
    MOVE G6B, 130, 10, 50
    MOVE G6C, 130, 10, 50
    WAIT

    'DELAY 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    RETURN
    'GOTO RX_EXIT
    '*****************************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1_LOOP:
    '  MOVE G6B, 190, 10, 50
    ' MOVE G6C, 190, 10, 50  ,   ,
    WAIT
    DELAY 3
    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 12
        MOVE G6A,102,  73, 145,  93, 100, 100
        MOVE G6D,102,  79, 145,  93, 100, 100
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6A,102,  84, 145,  78, 100, 100
        MOVE G6D,102,  68, 145,  108, 100, 100
        MOVE G6A,100,  84, 145,  78, 100, 100
        MOVE G6D,100,  68, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,90,  90, 145,  78, 102, 100
        MOVE G6D,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 6
        MOVE G6A,90,  80, 130, 102, 104
        MOVE G6D,105,  76, 146,  93,  100
        WAIT
    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 12
        MOVE G6A,102,  73, 145,  93, 100, 100
        MOVE G6D,102,  79, 145,  93, 100, 100
        MOVE G6A,100,  73, 145,  93, 100, 100
        MOVE G6D,100,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6A,102,  88, 145,  78, 100, 100
        MOVE G6D,102,  65, 145,  108, 100, 100
        MOVE G6A,100,  88, 145,  78, 100, 100
        MOVE G6D,100,  65, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6A,104,  86, 146,  80, 100, 100
        MOVE G6D,90,  58, 145,  110, 100, 100
        WAIT
        SPEED 6
        MOVE G6D,90,  85, 130, 98, 104
        MOVE G6A,105,  77, 146,  93,  100
        WAIT
    ENDIF
    SPEED 10
    'GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT
    GOTO RX_EXIT
    '*************************************************

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1:
    MOTORMODE G6A,3,3,3,3,2
    MOTORMODE G6D,3,3,3,3,2

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1_LOOP:
    '   MOVE G6B, 190, 10, 50
    '  MOVE G6C, 190, 10, 50
    WAIT
    DELAY 3

    IF ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0 THEN
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 1
        SPEED 12
        MOVE G6D,102,  73, 145,  93, 100, 100
        MOVE G6A,102,  79, 145,  93, 100, 100
        WAIT

        SPEED 5
        MOVE G6D,102,  84, 145,  78, 100, 100
        MOVE G6A,102,  68, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,90,  90, 145,  78, 102, 100
        MOVE G6A,104,  71, 145,  105, 100, 100
        WAIT
        SPEED 6
        MOVE G6D,90,  80, 130, 102, 104
        MOVE G6A,105,  76, 146,  93,  100
        WAIT



    ELSE
        ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ = 0
        SPEED 12
        MOVE G6D,102,  73, 145,  93, 100, 100
        MOVE G6A,102,  79, 145,  93, 100, 100
        WAIT


        SPEED 5
        MOVE G6D,102,  88, 145,  78, 100, 100
        MOVE G6A,102,  65, 145,  108, 100, 100
        WAIT

        SPEED 7
        MOVE G6D,104,  86, 146,  80, 100, 100
        MOVE G6A,90,  58, 145,  110, 100, 100
        WAIT

        SPEED 6
        MOVE G6A,90,  85, 130, 98, 104
        MOVE G6D,105,  77, 146,  93,  100
        WAIT



    ENDIF

    SPEED 10
    '    GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    WAIT

    GOTO RX_EXIT


ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 6
    GOSUB All_motor_mode3
    MOVE G6B, 190, 10, 50
    MOVE G6C, 190, 10, 50
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 6
    MOVE G6D,  90,  74, 144,  94, 109
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 8
    MOVE G6D,90, 90, 120, 101, 109,99
    MOVE G6A,108,  76, 147,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 101, 106,99
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 114, 109
    MOVE G6A,108,  76, 147,  89,  95
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 89,  97
    MOVE G6A,90, 100, 142,  68, 107
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_1_4:
    SPEED 9
    MOVE G6A,95, 90, 120, 101, 110,99
    MOVE G6D,108,  76, 146,  92,  95,99
    WAIT

    SPEED 7
    MOVE G6A,100,  76, 145,  92, 99, 100
    MOVE G6D,100,  76, 145,  92, 99, 100
    WAIT

    RETURN

    '*******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 6
    GOSUB All_motor_mode3
    MOVE G6B, 150, 10, 50
    MOVE G6C, 150, 10, 50
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 6
    MOVE G6D,  90,  74, 144,  94, 109
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 8
    MOVE G6D,90, 90, 120, 101, 109,99
    MOVE G6A,108,  76, 147,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 101, 106,99
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 114, 109
    MOVE G6A,108,  76, 147,  89,  95
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 89,  97
    MOVE G6A,90, 100, 142,  68, 107
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_2_4:
    SPEED 9
    MOVE G6A,95, 90, 120, 101, 110,99
    MOVE G6D,108,  76, 146,  92,  95,99
    WAIT

    SPEED 7
    MOVE G6A,100,  76, 145,  92, 99, 100
    MOVE G6D,100,  76, 145,  92, 99, 100
    WAIT

    RETURN
    '*******************************************
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3:
    ï¿½ï¿½ï¿½ï¿½Óµï¿½ = 8
    ï¿½Â¿ï¿½Óµï¿½ = 4
    ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0

    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½18ï¿½ï¿½
    'DELAY 20
    SPEED 6
    GOSUB All_motor_mode3
    MOVE G6B, 130, 10, 50
    MOVE G6C, 130, 10, 50
    WAIT

    DELAY 20
    'HIGHSPEED SETON

    SPEED 6
    MOVE G6D,  90,  74, 144,  94, 109
    MOVE G6A, 108,  76, 146,  93, 96
    WAIT

    SPEED 8
    MOVE G6D,90, 90, 120, 101, 109,99
    MOVE G6A,108,  76, 147,  92,  96,100
    WAIT

    'HIGHSPEED SETOFF
    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_2	

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_2:
    MOVE G6A,110,  76, 147,  93, 100,100
    MOVE G6D,96, 90, 120, 101, 106,99
    WAIT

ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_3:
    'ETX 4800,13 'ï¿½ï¿½ï¿½ï¿½ï¿½Úµå¸¦ ï¿½ï¿½ï¿½ï¿½

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    MOVE G6D, 90,  56, 145, 114, 109
    MOVE G6A,108,  76, 147,  89,  95
    WAIT

    SPEED ï¿½Â¿ï¿½Óµï¿½
    MOVE G6D,108,  76, 147, 89,  97
    MOVE G6A,90, 100, 142,  68, 107
    WAIT

    SPEED ï¿½ï¿½ï¿½ï¿½Óµï¿½

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    IF ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 1 THEN
        ï¿½Ñ¾ï¿½ï¿½ï¿½È®ï¿½ï¿½ = 0
        GOTO MAIN
    ENDIF


    ERX 4800,A, ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_4
    IF A = 11 THEN
        GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_4
        '    ELSE
        '    	MOVE G6A, 90, 100, 100, 115, 110,100
        ' 		MOVE G6D,112,  76, 146,  93,  96,100
        ' 		MOVE G6B,90
        ' 		MOVE G6C,110
        ' 		WAIT
        ' 		HIGHSPEED SETOFF
        ' 		SPEED 8

        ' 		MOVE G6D, 106,  76, 146,  93,  96,100		
        ' 		MOVE G6A,  88,  71, 152,  91, 106,100
        ' 		MOVE G6C, 100
        ' 		MOVE G6B, 100
        ' 		WAIT	
        ' 		SPEED 8
        ' 		GOSUB ï¿½âº»ï¿½Ú¼ï¿½2

        ' 		GOTO RX_EXIT
    ENDIF
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½_3_4:
    SPEED 9
    MOVE G6A,95, 90, 120, 101, 110,99
    MOVE G6D,108,  76, 146,  92,  95,99
    WAIT

    SPEED 7
    MOVE G6A,100,  76, 145,  92, 99, 100
    MOVE G6D,100,  76, 145,  92, 99, 100
    WAIT

    RETURN

    '******************************************
ï¿½ï¿½Ü¿Þ¹ß¿ï¿½ï¿½ï¿½ï¿½ï¿½1cm:
    GOSUB All_motor_mode3

    SPEED 4
    MOVE G6A, 88,  71, 152,  91, 110
    MOVE G6D,108,  77, 146,  93,  94
    MOVE G6B,100,40
    MOVE G6C,100,40
    WAIT

    SPEED 8
    MOVE G6A, 90, 100, 110, 100, 114
    MOVE G6D,114,  78, 146,  93,  94
    WAIT

    GOSUB Leg_motor_mode2

    SPEED 8
    MOVE G6A, 90, 140, 35, 130, 114
    MOVE G6D,114,  71, 155,  90,  94
    WAIT


    SPEED 12
    MOVE G6A,  80, 55, 130, 140, 114,
    MOVE G6D,114,  70, 155,  90,  94
    WAIT

    GOSUB Leg_motor_mode3

    SPEED 7
    MOVE G6A, 105, 75, 100, 155, 100,
    MOVE G6D,95,  90, 165,  70, 100
    MOVE G6B,160,50
    MOVE G6C,160,40
    WAIT

    SPEED 6
    MOVE G6A, 114, 90, 90, 155,100,
    MOVE G6D,95,  100, 165,  65, 105
    MOVE G6B,180,50
    MOVE G6C,180,30
    WAIT

    '****************************
    GOSUB Leg_motor_mode2	
    SPEED 8
    MOVE G6A, 114, 90, 100, 150,95,
    MOVE G6D,95,  90, 165,  70, 105
    WAIT

    SPEED 12
    MOVE G6A, 114, 90, 100, 150,95,
    MOVE G6D,90,  120, 40,  140, 108
    WAIT

    SPEED 10
    MOVE G6A, 114, 90, 110, 130,95,
    MOVE G6D,90,  95, 90,  145, 108
    MOVE G6B,140,50
    MOVE G6C,140,30
    WAIT

    SPEED 10
    MOVE G6A, 110, 90, 110, 130,95,
    MOVE G6D,80,  85, 110,  135, 108
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 5
    MOVE G6D, 98, 90, 110, 125,99,
    MOVE G6A,98,  90, 110,  125, 99
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 6
    MOVE G6A,100,  77, 145,  93, 100, 100
    MOVE G6D,100,  77, 145,  93, 100, 100
    MOVE G6B,100,  30,  80
    MOVE G6C,100,  30,  80
    WAIT

    GOTO RX_EXIT
    '****************************************

ï¿½ï¿½Ü¿ï¿½ï¿½ï¿½ï¿½ß¿ï¿½ï¿½ï¿½ï¿½ï¿½1cm:
    GOSUB All_motor_mode3
    GOSUB All_motor_mode3

    SPEED 4
    MOVE G6D, 88,  71, 152,  91, 110
    MOVE G6A,108,  77, 146,  93,  94
    MOVE G6B,100,40
    MOVE G6C,100,40
    WAIT

    SPEED 8
    MOVE G6D, 90, 100, 110, 100, 114
    MOVE G6A,113,  78, 146,  93,  94
    WAIT

    GOSUB Leg_motor_mode2

    SPEED 8
    MOVE G6D, 90, 140, 35, 130, 114
    MOVE G6A,113,  71, 155,  90,  94
    WAIT


    SPEED 12
    MOVE G6D,  80, 55, 130, 140, 114,
    MOVE G6A,113,  70, 155,  90,  94
    WAIT

    GOSUB Leg_motor_mode3

    SPEED 7
    MOVE G6D, 105, 75, 100, 155, 100,
    MOVE G6A,95,  90, 165,  70, 100
    MOVE G6C,160,50
    MOVE G6B,160,40
    WAIT

    SPEED 6
    MOVE G6D, 113, 90, 90, 155,100,
    MOVE G6A,95,  100, 165,  65, 105
    MOVE G6C,180,50
    MOVE G6B,180,30
    WAIT

    '****************************
    GOSUB Leg_motor_mode2	
    SPEED 8
    MOVE G6D, 114, 90, 100, 150,95,
    MOVE G6A,95,  90, 165,  70, 105
    WAIT

    SPEED 12
    MOVE G6D, 114, 90, 100, 150,95,
    MOVE G6A,90,  120, 40,  140, 108
    WAIT

    SPEED 10
    MOVE G6D, 114, 90, 110, 130,95,
    MOVE G6A,90,  95, 90,  145, 108
    MOVE G6C,140,50
    MOVE G6B,140,30
    WAIT

    SPEED 10
    MOVE G6D, 110, 90, 110, 130,95,
    MOVE G6A,80,  85, 110,  135, 108
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 5
    MOVE G6A, 98, 90, 110, 125,99,
    MOVE G6D,98,  90, 110,  125, 99
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 6
    MOVE G6A,100,  77, 145,  93, 100, 100
    MOVE G6D,100,  77, 145,  93, 100, 100
    MOVE G6B,100,  30,  80
    MOVE G6C,100,  30,  80
    WAIT

    GOTO RX_EXIT
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD

    '******************************************
<<<<<<< HEAD
<<<<<<< HEAD
°è´Ü¿À¸¥¹ß³»¸®±â1cm:
=======
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    
    '******************************************    
=======

    '******************************************
>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======
>>>>>>> 69503e3 (Chore: ëª¨ì…˜ íŒŒì¼ì— ê³„ë‹¨ ë‚´ë ¤ê°€ëŠ” ëª¨ì…˜ ì¶”ê°€)

ï¿½ï¿½Ü¿ï¿½ï¿½ï¿½ï¿½ß³ï¿½ï¿½ï¿½ï¿½ï¿½1cm:
=======
°è´Ü¿À¸¥¹ß³»¸®±â1cm:
    
>>>>>>> f20e10f (Chore: ëª¨ì…˜ íŒŒì¼ì— ê³„ë‹¨ ë‚´ë ¤ê°€ëŠ” ëª¨ì…˜ ì¶”ê°€)
    GOSUB All_motor_mode3

    '¿À¸¥¹ß ¿ÏÀü Áý¾î³Ö±â ''''
    SPEED 5
    MOVE G6A, 100, 110,  112, 92,  101, 100
    MOVE G6D,  100,  112, 112, 92, 101, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß¸ñ ¿ÞÂÊÀ¸·Î
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  85,  110, 112, 92, 108, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿À¸¥¹ß °ÅÀÇ¹ß¸ñ±îÁö   Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  110, 112, 92, 108, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿À¸¥¹ß °ÅÀÇ  Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  105, 63, 119, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  15, 139, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹«¸­¼öÁ÷ ÃÖÁ¾µé±â
    SPEED 2
    MOVE G6A, 112, 110,  112, 77,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹«¸­ ¸¹ÀÌµé±â
    SPEED 1
    MOVE G6A, 112, 125,  102, 65,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT	

    '¿Þ¹«¸­ µé±â
    SPEED 5
    MOVE G6A, 108, 140,  92, 82,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '½ÃÇè ¿À¸¥¹ß·Î ÁöÅÊÇÏ°í ³»·Á°¡´Â µ¿ÀÛ
    SPEED 5
    MOVE G6A, 105, 140,  92, 102,  81, 100
    MOVE G6D,  95,  15, 169, 149, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß , ¿À¸¥¹ß ¼¼¿ì±â
    SPEED 5
    MOVE G6A, 105, 120,  112, 102,  81, 100
    MOVE G6D,  95,  35, 149, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß °ÅÀÇ ¼öÁ÷À¸·Î ¼¼¿ì±â ';';'
    SPEED 5
    MOVE G6A, 105, 120,  112, 102,  96, 100
    MOVE G6D,  100,  35, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹ß¸ñ ¿ÞÂÊÀ¸·Î ±â¿ïÀÌ±â
    SPEED 5
    MOVE G6A, 97, 120,  112, 102,  96, 100
    MOVE G6D,  105,  35, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­°ú »óÃ¼ ¼÷ÀÌ±â
    SPEED 3
    MOVE G6A, 97, 120,  112, 102,  96, 100
    MOVE G6D,  110,  45, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â
    SPEED 5
    MOVE G6A, 97, 120,  102, 107,  96, 100
    MOVE G6D,  110,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â (¿À¸¥¹ß ¹ß¸ñ Áß½É Àâ±â)
    SPEED 5
    MOVE G6A, 97, 120,  102, 107,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â
    SPEED 3
    MOVE G6A, 97, 105,  103, 132,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â 2
    SPEED 3
    MOVE G6A, 97, 110,  97, 160,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â 3
    SPEED 3
    MOVE G6A, 97, 110,  107, 160,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â1
    SPEED 3
    MOVE G6A, 90, 65,  149, 149,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â2
    SPEED 3
    MOVE G6A, 90, 65,  149, 149,  96, 100
    MOVE G6D,  107,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â3
    SPEED 3
    MOVE G6A, 97, 55,  149, 136,  96, 100
    MOVE G6D,  107,  55, 149, 139, 104, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT


    SPEED 4
    GOSUB ±âº»ÀÚ¼¼''°Ë¼ö ´ë»ó

    ETX 4800, 254

    RETURN
    '******************************************
<<<<<<< HEAD
ï¿½ï¿½Ü¿Þ¹ß³ï¿½ï¿½ï¿½ï¿½ï¿½1cm:
    GOSUB All_motor_mode3
=======
°è´Ü¿Þ¹ß³»¸®±â1cm:
    
	GOSUB All_motor_mode3

    '¿Þ¹ß ¿ÏÀü Áý¾î³Ö±â ''''
    SPEED 5
    MOVE G6D, 100, 110,  112, 92,  101, 100
    MOVE G6A,  100,  112, 112, 92, 101, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß¸ñ ¿ÞÂÊÀ¸·Î
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  85,  110, 112, 92, 108, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿Þ¹ß °ÅÀÇ¹ß¸ñ±îÁö   Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  110, 112, 92, 108, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿Þ¹ß °ÅÀÇ  Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  105, 63, 119, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  15, 139, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹«¸­¼öÁ÷ ÃÖÁ¾µé±â
    SPEED 2
    MOVE G6D, 112, 110,  112, 77,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹«¸­ ¸¹ÀÌµé±â
    SPEED 1
    MOVE G6D, 112, 125,  102, 65,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT	

    '¿À¸¥¹«¸­ µé±â
    SPEED 5
    MOVE G6D, 108, 140,  92, 82,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '½ÃÇè ¿Þ¹ß·Î ÁöÅÊÇÏ°í ³»·Á°¡´Â µ¿ÀÛ
    SPEED 5
    MOVE G6D, 105, 140,  92, 102,  81, 100
    MOVE G6A,  95,  15, 169, 149, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß , ¿Þ¹ß ¼¼¿ì±â
    SPEED 5
    MOVE G6D, 105, 120,  112, 102,  81, 100
    MOVE G6A,  95,  35, 149, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß °ÅÀÇ ¼öÁ÷À¸·Î ¼¼¿ì±â ';';'
    SPEED 5
    MOVE G6D, 105, 120,  112, 102,  96, 100
    MOVE G6A,  100,  35, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹ß¸ñ ¿ÞÂÊÀ¸·Î ±â¿ïÀÌ±â
    SPEED 5
    MOVE G6D, 97, 120,  112, 102,  96, 100
    MOVE G6A,  105,  35, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­°ú »óÃ¼ ¼÷ÀÌ±â
    SPEED 3
    MOVE G6D, 97, 120,  112, 102,  96, 100
    MOVE G6A,  110,  45, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â
    SPEED 5
    MOVE G6D, 97, 120,  102, 107,  96, 100
    MOVE G6A,  110,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â (¿Þ¹ß ¹ß¸ñ Áß½É Àâ±â)
    SPEED 5
    MOVE G6D, 97, 120,  102, 107,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â
    SPEED 3
    MOVE G6D, 97, 105,  103, 132,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â 2
    SPEED 3
    MOVE G6D, 97, 110,  97, 160,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â 3
    SPEED 3
    MOVE G6D, 97, 110,  107, 160,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â1
    SPEED 3
    MOVE G6D, 90, 65,  149, 149,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â2
    SPEED 3
    MOVE G6D, 90, 65,  149, 149,  96, 100
    MOVE G6A,  107,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â3
    SPEED 3
    MOVE G6D, 97, 55,  149, 136,  96, 100
    MOVE G6A,  107,  55, 149, 139, 104, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

>>>>>>> f20e10f (Chore: ëª¨ì…˜ íŒŒì¼ì— ê³„ë‹¨ ë‚´ë ¤ê°€ëŠ” ëª¨ì…˜ ì¶”ê°€)

    SPEED 4
    GOSUB ±âº»ÀÚ¼¼''°Ë¼ö ´ë»ó

<<<<<<< HEAD
    SPEED 8
    MOVE G6A, 90, 100, 110, 100, 114
    MOVE G6D,114,  78, 146,  93,  94
    WAIT

    GOSUB Leg_motor_mode2

    SPEED 8
    MOVE G6A, 90, 140, 35, 130, 114
    MOVE G6D,114,  71, 155,  90,  94
    WAIT


<<<<<<< HEAD
    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    ' º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    ' IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ÀüÁøÁ¾Á¾°ÉÀ½_5_stop

    ERX 4800,A, »þ»è»þ»è1
    IF A <> A_old THEN
»þ»è»þ»è5_stop:
        MOVE G6A,95,  87, 143, 97, 102
        MOVE G6D,104,  76, 145,  92,  100
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
		GOTO »þ»è»þ»è1
    '******************************************

È½¼ö_»þ»è»þ»è:
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    SPEED 13
    'HIGHSPEED·Î ¾È ÇÏ¸é µÚ·Î °¨... ¹ÌÄ£³ðÀÎ µí
    'HIGHSPEED SETON
    '..... ÀÌ°Å ÇÏ¸é ´ÙÀ½ ¸ð¼Çµé±îÁö ´Ù °³»¡¶óÁö´Âµ¥ º¹±Í¸¦ ¾î¶»°Ô ÇÏ´ÂÁö ¸ð¸£°ÚÀ½
<<<<<<< HEAD
=======


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è4
    ENDIF


    '**********************

È½¼ö_»þ»è»þ»è1: '¿Þ¹ß
    'HIGHSPEED SETON
    MOVE G6D,104,  77, 147, 93, 100
    MOVE G6A,95,  95, 143,  94,  102
    MOVE G6B, 100
    MOVE G6C, 100
    WAIT
È½¼ö_»þ»è»þ»è2:

    MOVE G6A,99,    75, 146, 97,  98
    MOVE G6D, 95,  77, 147,  90, 100
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0

        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO È½¼ö_»þ»è»þ»è_2_stop

    ERX 4800,A, È½¼ö_»þ»è»þ»è4
    IF A <> A_old THEN
È½¼ö_»þ»è»þ»è_2_stop:
        MOVE G6D,104,  77, 147, 93, 100
        MOVE G6A,95,  95, 143,  94,  102
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

È½¼ö_»þ»è»þ»è4: '¿À¸¥¹ß
    MOVE G6A,104,  77, 147, 93, 100
    MOVE G6D,95,  95, 143,  94,  102
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

È½¼ö_»þ»è»þ»è5:
    MOVE G6D,99,    75, 146, 97,  98
    MOVE G6A, 95,  77, 147,  93, 100
    WAIT


    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO È½¼ö_»þ»è»þ»è5_stop

    ERX 4800,A, È½¼ö_»þ»è»þ»è1
    IF A <> A_old THEN
È½¼ö_»þ»è»þ»è5_stop:
        MOVE G6A,104,  77, 147, 93, 100
        MOVE G6D,95,  95, 143,  94,  102
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
		GOTO »þ»è»þ»è1

>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è4
    ENDIF


    '**********************

È½¼ö_»þ»è»þ»è1: '¿Þ¹ß
    'HIGHSPEED SETON
    MOVE G6D,104,  77, 147, 93, 100
    MOVE G6A,95,  95, 143,  94,  102
    MOVE G6B, 100
    MOVE G6C, 100
    WAIT
È½¼ö_»þ»è»þ»è2:

    MOVE G6A,99,    75, 146, 97,  98
    MOVE G6D, 95,  77, 147,  90, 100
=======
    SPEED 12
    MOVE G6A,  80, 55, 130, 140, 114,
    MOVE G6D,114,  70, 155,  90,  94
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
    WAIT

    GOSUB Leg_motor_mode3

    SPEED 7
    MOVE G6A, 105, 75, 100, 155, 100,
    MOVE G6D,95,  90, 165,  70, 100
    MOVE G6B,160,50
    MOVE G6C,160,40
    WAIT

    SPEED 6
    MOVE G6A, 114, 90, 90, 155,100,
    MOVE G6D,95,  100, 165,  65, 105
    MOVE G6B,180,50
    MOVE G6C,180,30
    WAIT

    '****************************
    GOSUB Leg_motor_mode2	
    SPEED 8
    MOVE G6A, 114, 90, 100, 150,95,
    MOVE G6D,95,  90, 165,  70, 105
    WAIT

    SPEED 12
    MOVE G6A, 114, 90, 100, 150,95,
    MOVE G6D,90,  120, 40,  140, 108
    WAIT

    SPEED 10
    MOVE G6A, 114, 90, 110, 130,95,
    MOVE G6D,90,  95, 90,  145, 108
    MOVE G6B,140,50
    MOVE G6C,140,30
    WAIT

    SPEED 10
    MOVE G6A, 110, 90, 110, 130,95,
    MOVE G6D,80,  85, 110,  135, 108
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 5
    MOVE G6D, 98, 90, 110, 125,99,
    MOVE G6A,98,  90, 110,  125, 99
    MOVE G6B,110,40
    MOVE G6C,110,40
    WAIT

    SPEED 6
    MOVE G6A,100,  77, 145,  93, 100, 100
    MOVE G6D,100,  77, 145,  93, 100, 100
    MOVE G6B,100,  30,  80
    MOVE G6C,100,  30,  80
    WAIT

<<<<<<< HEAD
=======
    
    '******************************************    
=======

    '******************************************
>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)

=======
>>>>>>> f20e10f (Chore: ëª¨ì…˜ íŒŒì¼ì— ê³„ë‹¨ ë‚´ë ¤ê°€ëŠ” ëª¨ì…˜ ì¶”ê°€)
°è´Ü¿À¸¥¹ß³»¸®±â1cm:
    
    GOSUB All_motor_mode3

    '¿À¸¥¹ß ¿ÏÀü Áý¾î³Ö±â ''''
    SPEED 5
    MOVE G6A, 100, 110,  112, 92,  101, 100
    MOVE G6D,  100,  112, 112, 92, 101, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß¸ñ ¿ÞÂÊÀ¸·Î
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  85,  110, 112, 92, 108, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿À¸¥¹ß °ÅÀÇ¹ß¸ñ±îÁö   Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  110, 112, 92, 108, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿À¸¥¹ß °ÅÀÇ  Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  105, 63, 119, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß Áý¾î³Ö±â
    SPEED 5
    MOVE G6A, 112, 110,  112, 92,  101, 100
    MOVE G6D,  95,  15, 139, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹«¸­¼öÁ÷ ÃÖÁ¾µé±â
    SPEED 2
    MOVE G6A, 112, 110,  112, 77,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹«¸­ ¸¹ÀÌµé±â
    SPEED 1
    MOVE G6A, 112, 125,  102, 65,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT	

    '¿Þ¹«¸­ µé±â
    SPEED 5
    MOVE G6A, 108, 140,  92, 82,  91, 100
    MOVE G6D,  95,  15, 169, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '½ÃÇè ¿À¸¥¹ß·Î ÁöÅÊÇÏ°í ³»·Á°¡´Â µ¿ÀÛ
    SPEED 5
    MOVE G6A, 105, 140,  92, 102,  81, 100
    MOVE G6D,  95,  15, 169, 149, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß , ¿À¸¥¹ß ¼¼¿ì±â
    SPEED 5
    MOVE G6A, 105, 120,  112, 102,  81, 100
    MOVE G6D,  95,  35, 149, 139, 116, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß °ÅÀÇ ¼öÁ÷À¸·Î ¼¼¿ì±â ';';'
    SPEED 5
    MOVE G6A, 105, 120,  112, 102,  96, 100
    MOVE G6D,  100,  35, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹ß¸ñ ¿ÞÂÊÀ¸·Î ±â¿ïÀÌ±â
    SPEED 5
    MOVE G6A, 97, 120,  112, 102,  96, 100
    MOVE G6D,  105,  35, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­°ú »óÃ¼ ¼÷ÀÌ±â
    SPEED 3
    MOVE G6A, 97, 120,  112, 102,  96, 100
    MOVE G6D,  110,  45, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â
    SPEED 5
    MOVE G6A, 97, 120,  102, 107,  96, 100
    MOVE G6D,  110,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â (¿À¸¥¹ß ¹ß¸ñ Áß½É Àâ±â)
    SPEED 5
    MOVE G6A, 97, 120,  102, 107,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â
    SPEED 3
    MOVE G6A, 97, 105,  103, 132,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â 2
    SPEED 3
    MOVE G6A, 97, 110,  97, 160,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ¾ÕÀ¸·Î °®°í¿À±â 3
    SPEED 3
    MOVE G6A, 97, 110,  107, 160,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â1
    SPEED 3
    MOVE G6A, 90, 65,  149, 149,  96, 100
    MOVE G6D,  112,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â2
    SPEED 3
    MOVE G6A, 90, 65,  149, 149,  96, 100
    MOVE G6D,  107,  55, 149, 139, 106, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß ³»¸®±â3
    SPEED 3
    MOVE G6A, 97, 55,  149, 136,  96, 100
    MOVE G6D,  107,  55, 149, 139, 104, 100
    MOVE G6B, 101,  36,  85, 100, 100, 101
    MOVE G6C,  99,  32,  92, 100,  95, 100
    WAIT


    SPEED 4
    GOSUB ±âº»ÀÚ¼¼''°Ë¼ö ´ë»ó

    ETX 4800, 254

    RETURN
    '******************************************
°è´Ü¿Þ¹ß³»¸®±â1cm:
    
	GOSUB All_motor_mode3

    '¿Þ¹ß ¿ÏÀü Áý¾î³Ö±â ''''
    SPEED 5
    MOVE G6D, 100, 110,  112, 92,  101, 100
    MOVE G6A,  100,  112, 112, 92, 101, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß¸ñ ¿ÞÂÊÀ¸·Î
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  85,  110, 112, 92, 108, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿Þ¹ß °ÅÀÇ¹ß¸ñ±îÁö   Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  110, 112, 92, 108, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT 	

    '¿Þ¹ß °ÅÀÇ  Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  105, 63, 119, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß Áý¾î³Ö±â
    SPEED 5
    MOVE G6D, 112, 110,  112, 92,  101, 100
    MOVE G6A,  95,  15, 139, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹«¸­¼öÁ÷ ÃÖÁ¾µé±â
    SPEED 2
    MOVE G6D, 112, 110,  112, 77,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹«¸­ ¸¹ÀÌµé±â
    SPEED 1
    MOVE G6D, 112, 125,  102, 65,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT	

    '¿À¸¥¹«¸­ µé±â
    SPEED 5
    MOVE G6D, 108, 140,  92, 82,  91, 100
    MOVE G6A,  95,  15, 169, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '½ÃÇè ¿Þ¹ß·Î ÁöÅÊÇÏ°í ³»·Á°¡´Â µ¿ÀÛ
    SPEED 5
    MOVE G6D, 105, 140,  92, 102,  81, 100
    MOVE G6A,  95,  15, 169, 149, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿À¸¥¹ß , ¿Þ¹ß ¼¼¿ì±â
    SPEED 5
    MOVE G6D, 105, 120,  112, 102,  81, 100
    MOVE G6A,  95,  35, 149, 139, 116, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß °ÅÀÇ ¼öÁ÷À¸·Î ¼¼¿ì±â ';';'
    SPEED 5
    MOVE G6D, 105, 120,  112, 102,  96, 100
    MOVE G6A,  100,  35, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹ß¸ñ ¿ÞÂÊÀ¸·Î ±â¿ïÀÌ±â
    SPEED 5
    MOVE G6D, 97, 120,  112, 102,  96, 100
    MOVE G6A,  105,  35, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­°ú »óÃ¼ ¼÷ÀÌ±â
    SPEED 3
    MOVE G6D, 97, 120,  112, 102,  96, 100
    MOVE G6A,  110,  45, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â
    SPEED 5
    MOVE G6D, 97, 120,  102, 107,  96, 100
    MOVE G6A,  110,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¹«¸­ ¾à°£ ¿Ã¸®±â (¿Þ¹ß ¹ß¸ñ Áß½É Àâ±â)
    SPEED 5
    MOVE G6D, 97, 120,  102, 107,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â
    SPEED 3
    MOVE G6D, 97, 105,  103, 132,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â 2
    SPEED 3
    MOVE G6D, 97, 110,  97, 160,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ¾ÕÀ¸·Î °®°í¿À±â 3
    SPEED 3
    MOVE G6D, 97, 110,  107, 160,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â1
    SPEED 3
    MOVE G6D, 90, 65,  149, 149,  96, 100
    MOVE G6A,  112,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â2
    SPEED 3
    MOVE G6D, 90, 65,  149, 149,  96, 100
    MOVE G6A,  107,  55, 149, 139, 106, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT

    '¿Þ¹ß ³»¸®±â3
    SPEED 3
    MOVE G6D, 97, 55,  149, 136,  96, 100
    MOVE G6A,  107,  55, 149, 139, 104, 100
    MOVE G6C, 101,  36,  85, 100, 100, 101
    MOVE G6B,  99,  32,  92, 100,  95, 100
    WAIT


    SPEED 4
    GOSUB ±âº»ÀÚ¼¼''°Ë¼ö ´ë»ó

    ETX 4800, 254

    RETURN

    '******************************************

»þ»è»þ»è:
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    SPEED 13
    'HIGHSPEED·Î ¾È ÇÏ¸é µÚ·Î °¨... ¹ÌÄ£³ðÀÎ µí
    'HIGHSPEED SETON
    '..... ÀÌ°Å ÇÏ¸é ´ÙÀ½ ¸ð¼Çµé±îÁö ´Ù °³»¡¶óÁö´Âµ¥ º¹±Í¸¦ ¾î¶»°Ô ÇÏ´ÂÁö ¸ð¸£°ÚÀ½


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è4
    ENDIF


    '**********************

»þ»è»þ»è1: '¿Þ¹ß
    'HIGHSPEED SETON
    MOVE G6D,104,  77, 147, 93, 100
    MOVE G6A,95,  95, 143,  94,  102
    MOVE G6B, 100
    MOVE G6C, 100
    WAIT
»þ»è»þ»è2:

    MOVE G6A,99,    75, 146, 97,  98
    MOVE G6D, 95,  77, 147,  90, 100
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0

        GOTO RX_EXIT
    ENDIF

    ' º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    'IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ÀüÁøÁ¾Á¾°ÉÀ½_2_stop

    ERX 4800,A, »þ»è»þ»è4
    IF A <> A_old THEN
»þ»è»þ»è_2_stop:
        MOVE G6D,95,  87, 143, 97, 102
        MOVE G6A,104,  76, 145,  92,  100
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

»þ»è»þ»è4: '¿À¸¥¹ß
    MOVE G6A,104,  77, 147, 93, 100
    MOVE G6D,95,  95, 143,  94,  102
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

»þ»è»þ»è5:
    MOVE G6D,99,    75, 146, 97,  98
    MOVE G6A, 95,  77, 147,  93, 100
    WAIT


    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    ' º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    ' IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ÀüÁøÁ¾Á¾°ÉÀ½_5_stop

    ERX 4800,A, »þ»è»þ»è1
    IF A <> A_old THEN
»þ»è»þ»è5_stop:
        MOVE G6A,95,  87, 143, 97, 102
        MOVE G6D,104,  76, 145,  92,  100
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
		GOTO »þ»è»þ»è1
    '******************************************
<<<<<<< HEAD
    
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======

<<<<<<< HEAD
>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======

>>>>>>> ae648b4 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ê°‘ ìˆ˜ì • (ë’¤ë¡œ ê°€ëŠ” ëª¨ì…˜ ìƒíƒœ))
=======
    GOTO RX_EXIT
=======
    ETX 4800, 254
>>>>>>> 69503e3 (Chore: ëª¨ì…˜ íŒŒì¼ì— ê³„ë‹¨ ë‚´ë ¤ê°€ëŠ” ëª¨ì…˜ ì¶”ê°€)

    RETURN

    '******************************************

»þ»è»þ»è:
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    SPEED 13
    'HIGHSPEED·Î ¾È ÇÏ¸é µÚ·Î °¨... ¹ÌÄ£³ðÀÎ µí
    'HIGHSPEED SETON
    '..... ÀÌ°Å ÇÏ¸é ´ÙÀ½ ¸ð¼Çµé±îÁö ´Ù °³»¡¶óÁö´Âµ¥ º¹±Í¸¦ ¾î¶»°Ô ÇÏ´ÂÁö ¸ð¸£°ÚÀ½

È½¼ö_»þ»è»þ»è:
    GOSUB All_motor_mode3
    º¸ÇàCOUNT = 0
    SPEED 13
    'HIGHSPEED·Î ¾È ÇÏ¸é µÚ·Î °¨... ¹ÌÄ£³ðÀÎ µí
    'HIGHSPEED SETON
    '..... ÀÌ°Å ÇÏ¸é ´ÙÀ½ ¸ð¼Çµé±îÁö ´Ù °³»¡¶óÁö´Âµ¥ º¹±Í¸¦ ¾î¶»°Ô ÇÏ´ÂÁö ¸ð¸£°ÚÀ½


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è4
    ENDIF


    '**********************

È½¼ö_»þ»è»þ»è1: '¿Þ¹ß
    'HIGHSPEED SETON
    MOVE G6D,104,  77, 147, 93, 100
    MOVE G6A,95,  95, 143,  94,  102
    MOVE G6B, 100
    MOVE G6C, 100
    WAIT
È½¼ö_»þ»è»þ»è2:

    MOVE G6A,99,    75, 146, 97,  98
    MOVE G6D, 95,  77, 147,  90, 100
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0

        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO È½¼ö_»þ»è»þ»è_2_stop

    ERX 4800,A, È½¼ö_»þ»è»þ»è4
    IF A <> A_old THEN
È½¼ö_»þ»è»þ»è_2_stop:
        MOVE G6D,95,  87, 143, 97, 102
        MOVE G6A,104,  76, 145,  92,  100
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

È½¼ö_»þ»è»þ»è4: '¿À¸¥¹ß
    MOVE G6A,104,  77, 147, 93, 100
    MOVE G6D,95,  95, 143,  94,  102
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

È½¼ö_»þ»è»þ»è5:
    MOVE G6D,99,    75, 146, 97,  98
    MOVE G6A, 95,  77, 147,  93, 100
    WAIT


    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO È½¼ö_»þ»è»þ»è5_stop

    ERX 4800,A, È½¼ö_»þ»è»þ»è1
    IF A <> A_old THEN
È½¼ö_»þ»è»þ»è5_stop:
        MOVE G6A,95,  87, 143, 97, 102
        MOVE G6D,104,  76, 145,  92,  100
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
		GOTO »þ»è»þ»è1


    IF º¸Çà¼ø¼­ = 0 THEN
        º¸Çà¼ø¼­ = 1
        MOVE G6A,95,  76, 147,  93, 101
        MOVE G6D,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è1
    ELSE
        º¸Çà¼ø¼­ = 0
        MOVE G6D,95,  76, 147,  93, 101
        MOVE G6A,101,  76, 147,  93, 98
        MOVE G6B,100
        MOVE G6C,100
        WAIT

        GOTO »þ»è»þ»è4
    ENDIF


    '**********************

»þ»è»þ»è1: '¿Þ¹ß
    'HIGHSPEED SETON
    MOVE G6D,104,  77, 147, 93, 100
    MOVE G6A,95,  95, 143,  94,  102
    MOVE G6B, 100
    MOVE G6C, 100
    WAIT
»þ»è»þ»è2:

    MOVE G6A,99,    75, 146, 97,  98
    MOVE G6D, 95,  77, 147,  90, 100
    WAIT

    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0

        GOTO RX_EXIT
    ENDIF

    ' º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    'IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ÀüÁøÁ¾Á¾°ÉÀ½_2_stop

    ERX 4800,A, »þ»è»þ»è4
    IF A <> A_old THEN
»þ»è»þ»è_2_stop:
        MOVE G6D,95,  87, 143, 97, 102
        MOVE G6A,104,  76, 145,  92,  100
        MOVE G6C, 100
        MOVE G6B,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF

    '*********************************

»þ»è»þ»è4: '¿À¸¥¹ß
    MOVE G6A,104,  77, 147, 93, 100
    MOVE G6D,95,  95, 143,  94,  102
    MOVE G6C, 100
    MOVE G6B, 100
    WAIT

»þ»è»þ»è5:
    MOVE G6D,99,    75, 146, 97,  98
    MOVE G6A, 95,  77, 147,  93, 100
    WAIT


    GOSUB ¾ÕµÚ±â¿ï±âÃøÁ¤
    IF ³Ñ¾îÁøÈ®ÀÎ = 1 THEN
        ³Ñ¾îÁøÈ®ÀÎ = 0
        GOTO RX_EXIT
    ENDIF

    ' º¸ÇàCOUNT = º¸ÇàCOUNT + 1
    ' IF º¸ÇàCOUNT > º¸ÇàÈ½¼ö THEN  GOTO ÀüÁøÁ¾Á¾°ÉÀ½_5_stop

    ERX 4800,A, »þ»è»þ»è1
    IF A <> A_old THEN
»þ»è»þ»è5_stop:
        MOVE G6A,95,  87, 143, 97, 102
        MOVE G6D,104,  76, 145,  92,  100
        MOVE G6B, 100
        MOVE G6C,100
        WAIT
        HIGHSPEED SETOFF
        SPEED 15
        GOSUB ¾ÈÁ¤È­ÀÚ¼¼
        SPEED 5
        GOSUB ±âº»ÀÚ¼¼2

        'DELAY 400
        GOTO RX_EXIT
    ENDIF
		GOTO »þ»è»þ»è1
    '******************************************
<<<<<<< HEAD
    
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======

<<<<<<< HEAD
>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======

>>>>>>> 666293e (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ê°‘ ìˆ˜ì • (ë’¤ë¡œ ê°€ëŠ” ëª¨ì…˜ ìƒíƒœ))
    '******************************************


MAIN: 'ï¿½óº§¼ï¿½ï¿½ï¿½

    ETX 4800, 200 ' ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ È®ï¿½ï¿½ ï¿½Û½ï¿½ ï¿½ï¿½

MAIN_2:

    GOSUB ï¿½ÕµÚ±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    GOSUB ï¿½Â¿ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    GOSUB ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ï¿½ï¿½È®ï¿½ï¿½


    ERX 4800,A,MAIN_2	

    A_old = A

    '**** ï¿½Ô·Âµï¿½ Aï¿½ï¿½ï¿½ï¿½ 0 ï¿½Ì¸ï¿½ MAIN ï¿½óº§·ï¿½ ï¿½ï¿½ï¿½ï¿½
    '**** 1ï¿½Ì¸ï¿½ 	 ï¿½ï¿½, 2ï¿½Ì¸ï¿½ key2ï¿½ï¿½... ï¿½ï¿½ï¿½Â¹ï¿½
    ON A GOTO MAIN,KEY1,KEY2,KEY3,KEY4,KEY5,KEY6,KEY7,KEY8,KEY9,KEY10,KEY11,KEY12,KEY13,KEY14,KEY15,KEY16,KEY17,KEY18 ,KEY19,KEY20,KEY21,KEY22,KEY23,KEY24,KEY25,KEY26,KEY27,KEY28 ,KEY29,KEY30,KEY31,KEY32


    IF A > 100 AND A < 110 THEN
        BUTTON_NO = A - 100
        GOSUB Number_Play
        'GOSUB SOUND_PLAY_CHK
        GOSUB GOSUB_RX_EXIT


    ELSEIF A = 250 THEN
        GOSUB All_motor_mode3
        SPEED 4
        MOVE G6A,100,  76, 145,  93, 100, 100
        MOVE G6D,100,  76, 145,  93, 100, 100
        MOVE G6B,100,  40,  90,
        MOVE G6C,100,  40,  90,
        WAIT
        DELAY 500
        SPEED 6
        GOSUB ï¿½âº»ï¿½Ú¼ï¿½

    ENDIF


    GOTO MAIN	
    '*******************************************
    '		MAIN ï¿½óº§·ï¿½ ï¿½ï¿½ï¿½ï¿½
    '*******************************************

KEY1:
    ETX  4800,1

    ' ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ = 2
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10
    GOTO RX_EXIT
    '***************	
KEY2:
    ETX  4800,2

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    º¸ÇàÈ½¼ö = 1
=======
    º¸ÇàÈ½¼ö = 6
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
    º¸ÇàÈ½¼ö = 1
>>>>>>> 77312ab (Add: ì´¬ì˜.bas ì¶”ê°€)
    GOTO È½¼ö_ÀüÁøÁ¾Á¾°ÉÀ½
=======
    ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ = 6
    GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    ï¿½ï¿½ï¿½ï¿½È½ï¿½ï¿½ = 6
    GOTO È½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
=======
    º¸ÇàÈ½¼ö = 1
    GOTO È½¼ö_ÀüÁøÁ¾Á¾°ÉÀ½
>>>>>>> 77312ab (Add: ì´¬ì˜.bas ì¶”ê°€)
>>>>>>> ef4d111 (Add: ì´¬ì˜.bas ì¶”ê°€)

    GOTO RX_EXIT
    '***************

KEY3:
    ETX 4800, 3
    ' GOTO ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10
    GOTO RX_EXIT
KEY4:
    ETX 4800, 4
<<<<<<< HEAD
<<<<<<< HEAD
    GOSUB ¿ÞÂÊ¿·À¸·Î20
<<<<<<< HEAD
<<<<<<< HEAD
=======
    '  GOTO ¹®¿­±â¿ÞÂÊ3
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
=======
    GOSUB ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20
    '  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
    GOSUB ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20
    '  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3
=======
    GOSUB ¿ÞÂÊ¿·À¸·Î20
>>>>>>> 555d29a (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
>>>>>>> e914142 (Chore: ì „ë°©í•˜í–¥ ì„¸ë¶€ì ìœ¼ë¡œ ì¶”ê°€)
    GOTO RX_EXIT
    '***************
KEY5:
    ETX  4800,5

    'J = AD(ï¿½ï¿½ï¿½Ü¼ï¿½ADï¿½ï¿½Æ®)	'ï¿½ï¿½ï¿½Ü¼ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ ï¿½Ð±ï¿½
    'ETX 4800, J
    'BUTTON_NO = J
    'GOSUB Number_Play
    'GOSUB SOUND_PLAY_CHK
    'GOSUB GOSUB_RX_EXIT
    GOSUB ï¿½Ó¸ï¿½ï¿½Â¿ï¿½ï¿½ß¾ï¿½

    GOTO RX_EXIT
    '***************
KEY6:
    ETX 4800, 6
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½20
    GOTO RX_EXIT
KEY7:
    ETX 4800, 7
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45
    GOTO RX_EXIT
    '***************
KEY8:
    ETX  4800,8
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY9:
    ETX 4800, 9
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45
    GOTO RX_EXIT
    '***************
KEY10: '0
    ETX 4800, 10
    GOSUB ï¿½âº»ï¿½Ú¼ï¿½
    GOTO RX_EXIT
    '***************
KEY11: ' ï¿½ï¿½
    ETX  4800,11

    GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
    GOTO RX_EXIT

    '***************
KEY12: ' ï¿½ï¿½
    ETX  4800,12

    GOSUB ï¿½ï¿½ï¿½Ç³ï¿½ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY13: 'ï¿½ï¿½
    ETX  4800,13
    'GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½90ï¿½ï¿½
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1

    GOTO RX_EXIT
    '**************
KEY14: ' ï¿½ï¿½
    ETX  4800,14
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êµï¿½ï¿½ï¿½1
    GOTO RX_EXIT


    GOTO RX_EXIT
    '***************
KEY15: 'A
    ETX 4800, 15
    GOSUB ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½
    GOTO RX_EXIT
KEY16: ' POWER
    ETX  4800,16

    GOSUB Leg_motor_mode3
    IF MODE = 0 THEN
        SPEED 10
        MOVE G6A,100, 140,  37, 145, 100, 100
        MOVE G6D,100, 140,  37, 145, 100, 100
        WAIT
    ENDIF
    SPEED 4
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½Ú¼ï¿½	
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½

    GOSUB MOTOR_GET
    GOSUB MOTOR_OFF


    GOSUB GOSUB_RX_EXIT
KEY16_1:

    IF ï¿½ï¿½ï¿½ï¿½ONOFF = 1  THEN
        OUT 52,1
        DELAY 200
        OUT 52,0
        DELAY 200
    ENDIF
    ERX 4800,A,KEY16_1
    ETX  4800,A

    '**** RX DATA Number Sound ********
    BUTTON_NO = A
    GOSUB Number_Play
    'GOSUB SOUND_PLAY_CHK


    IF  A = 16 THEN 	'ï¿½Ù½ï¿½ ï¿½Ä¿ï¿½ï¿½ï¿½Æ°ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ß¸ï¿½ ï¿½ï¿½ï¿½ï¿½
        GOSUB MOTOR_ON
        SPEED 10
        MOVE G6A,100, 140,  37, 145, 100, 100
        MOVE G6D,100, 140,  37, 145, 100, 100
        WAIT

        GOSUB ï¿½âº»ï¿½Ú¼ï¿½2
        GOSUB ï¿½ï¿½ï¿½Ì·ï¿½ON
        GOSUB All_motor_mode3
        GOTO RX_EXIT
    ENDIF

    GOSUB GOSUB_RX_EXIT
    GOTO KEY16_1



    GOTO RX_EXIT
    '***************
KEY17: ' C
    ETX 4800, 17
    GOSUB ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY18: ' E
    ETX 4800, 18
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY19: 'P2
    ETX 4800, 19
    GOSUB  ï¿½ï¿½Ü¿ï¿½ï¿½ï¿½ï¿½ß³ï¿½ï¿½ï¿½ï¿½ï¿½1cm
    GOTO RX_EXIT
    '***************
KEY20: 'B
    ETX 4800, 20
    GOSUB ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY21: ' ï¿½ï¿½
    ETX  4800,21
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½70ï¿½ï¿½

    GOTO RX_EXIT
    '***************
KEY22: ' *
    ETX 4800, 22
    '  GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3
    'GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20
    ' GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45
    GOTO ï¿½ï¿½Ü¿Þ¹ß¿ï¿½ï¿½ï¿½ï¿½ï¿½1cm
    GOTO RX_EXIT
    '***************
KEY23: 'G
    ETX 4800, 23
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¿ï¿½ï¿½ï¿½ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY24: '#
    ETX 4800, 24
    GOSUB ï¿½ï¿½Ü¿ï¿½ï¿½ï¿½ï¿½ß¿ï¿½ï¿½ï¿½ï¿½ï¿½1cm
    GOTO RX_EXIT
    '***************
KEY25: 'P1
    ETX 4800, 25
    ' GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45
    ' GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½3
    'GOTO ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½20
    GOSUB ï¿½ï¿½Ü¿Þ¹ß³ï¿½ï¿½ï¿½ï¿½ï¿½1cm
    GOTO RX_EXIT
    '***************
KEY26: ' ï¿½ï¿½
    ETX  4800,26

<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    'SPEED 5
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
    º¸ÇàÈ½¼ö = 1
    GOSUB È½¼ö_»þ»è»þ»è
    'GOSUB ¹°°ÇÁý±â
=======
    SPEED 5
<<<<<<< HEAD
    GOSUB ¹°°ÇÁý±â
>>>>>>> 601e172 (Add: Motion file ì¶”ê°€)
=======
=======
    'SPEED 5
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
>>>>>>> d2ab6ee (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    GOSUB »þ»è»þ»è
    'GOSUB ¹°°ÇÁý±â
>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======
    'GOSUB »þ»è»þ»è
    GOSUB ¹°°ÇÁý±â
>>>>>>> 2bc48b6 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> bc73abb (Chore: stair_left_down ë¬´ë¦Ž, íŒ” ë²Œë¦¬ëŠ” ê°ë„ ìˆ˜ì •)
=======
    GOSUB »þ»è»þ»è
    'GOSUB ¹°°ÇÁý±â
>>>>>>> f330313 (Chore: stair_left_down ë¬´ë¦Ž, íŒ” ë²Œë¦¬ëŠ” ê°ë„ ìˆ˜ì •)
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> ef4d111 (Add: ì´¬ì˜.bas ì¶”ê°€)
=======
    'GOSUB »þ»è»þ»è
    GOSUB ¹°°ÇÁý±â
>>>>>>> 77312ab (Add: ì´¬ì˜.bas ì¶”ê°€)
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 12590a0 (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
=======
    º¸ÇàÈ½¼ö = 1
    GOSUB È½¼ö_»þ»è»þ»è
    'GOSUB ¹°°ÇÁý±â
>>>>>>> cbc020c (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
<<<<<<< HEAD
=======
=======
>>>>>>> def7285 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    SPEED 5
<<<<<<< HEAD
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
<<<<<<< HEAD
>>>>>>> be40f22 (Add: Motion file ì¶”ê°€)
=======
=======
=======
    'SPEED 5
>>>>>>> d2ab6ee (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
    GOSUB »þ»è»þ»è
    'GOSUB ¹°°ÇÁý±â
>>>>>>> 5f3e757 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
>>>>>>> c2e00a1 (Chore: ìƒ¤ì‚­ìƒ¤ì‚­ ëª¨ì…˜ ìˆ˜ì •)
=======
>>>>>>> 2a55088 (Chore: ìŒì„± ê´€ë ¨ ëª¨ì…˜ ìˆ˜ì •)
=======
>>>>>>> bc73abb (Chore: stair_left_down ë¬´ë¦Ž, íŒ” ë²Œë¦¬ëŠ” ê°ë„ ìˆ˜ì •)
=======
>>>>>>> ef4d111 (Add: ì´¬ì˜.bas ì¶”ê°€)
=======
>>>>>>> 12590a0 (Feat: íšŸìˆ˜_ìƒ¤ì‚­ìƒ¤ì‚­ ì¶”ê°€)
    GOTO RX_EXIT
    '***************
KEY27: ' D
    ETX 4800, 27
    GOTO ï¿½Ó¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½60ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY28: ' ï¿½ï¿½
    ETX 4800, 28
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½45ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY29: ' ï¿½ï¿½
    ETX 4800, 29
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½110ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY30: ' ï¿½ï¿½
    ETX 4800, 30
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½30ï¿½ï¿½
    GOTO RX_EXIT
    '***************
KEY31: ' ï¿½ï¿½
    ETX 4800, 31
    GOSUB ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½10ï¿½ï¿½
    GOTO RX_EXIT
    '***************

KEY32: ' F
    ETX 4800, 32
    GOSUB ï¿½ï¿½ï¿½È¹ï¿½ï¿½ï¿½ï¿½ï¿½
    GOTO RX_EXIT
    '***************
